[
    {
        "name":"Deputy Sheriff Justin Smith",
        "officer_name":"Justin Smith",
        "title":"Deputy",
        "department_name":"Stone County Sheriff's Office",
        "state_abbreviation":"AR",
        "cause":"Gunfire",
        "date":"2024-01-02",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26884-deputy-sheriff-justin-smith",
        "photo_url":"26884\/125\/c_justin-smith.jpg",
        "incident_description":"Deputy Sheriff Justin Smith was shot and killed while serving a warrant at the 300 block of Sawmill Road in Mountain View, Arkansas, at 4:30 p.m.\n\nWhen Deputy Smith attempted to arrest the subject for terroristic threats, he was shot. \n\nThe subject was apprehended after a brief standoff and charged with capital murder.\n\nDeputy Smith had served with the Stone County Sheriff's Office for 14 years.",
        "age":"60",
        "tour":"14 years",
        "badge":"512",
        "weapon":"Not available",
        "offender":"In custody",
        "lat":"35.9096070",
        "lon":"-92.1213919"
    },
    {
        "name":"Deputy Sheriff Eric Anthony Minix",
        "officer_name":"Eric Anthony Minix",
        "title":"Deputy",
        "department_name":"Coweta County Sheriff's Office",
        "state_abbreviation":"GA",
        "cause":"Struck by vehicle",
        "date":"2024-01-04",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26886-deputy-sheriff-eric-anthony-minix",
        "photo_url":"26886\/125\/c_eric-minix.jpg",
        "incident_description":"Deputy Sheriff Eric Minix died as a result of being struck by a police car while in a vehicle pursuit in Chambers County, Alabama.  \n\nThe pursuit began in Coweta County, Georgia, before crossing the state line into Alabama on I-85. An officer from Alabama successfully deployed spike strips, which caused the suspect vehicle to come to a stop. Deputy Minix exited his car and was giving commands to the driver when another officer arriving at the scene inadvertently struck him. He was transported to a local hospital where he succumbed to his injuries. \n\nAt least seven law enforcement agencies were assisting in apprehending the subject, who was driving a stolen vehicle. The subject was arrested at the scene. \n\nDeputy Sheriff Minix had served with the Coweta County Sheriff's Office for 4-1\/2 years and served on the canine unit. He had previously served with the Tyrone Police Department for over five years.  He is survived by his wife, three daughters, father and stepmother, and four sisters.\n\nHe was posthumously awarded the 2023 Officer of the Year.",
        "age":"31",
        "tour":"10 years",
        "badge":"145",
        "weapon":"Automobile",
        "offender":"In custody",
        "lat":"32.8418811",
        "lon":"-85.1925026"
    },
    {
        "name":"Deputy Sheriff Jeremy Malone",
        "officer_name":"Jeremy Malone",
        "title":"Deputy",
        "department_name":"George County Sheriff's Office",
        "state_abbreviation":"MS",
        "cause":"Gunfire",
        "date":"2024-01-04",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26887-deputy-sheriff-jeremy-malone",
        "photo_url":"26887\/125\/c_jeremy-malone.jpg",
        "incident_description":"Deputy Sheriff Jeremy Malone was shot and killed during a traffic stop in front of 12298 US Highway 98 at about 5:15 pm.\n\nHe was shot as he approached the vehicle. The suspect fled after shooting Deputy Malone and led officers on a pursuit through multiple counties before being shot and killed near Beaumont, Mississippi.\n\nDeputy Malone had served in law enforcement for 21 years, serving with the George County Sheriff's Office and previously served with the Leakesville Police Department, Jackson County Sheriff’s Department, Biloxi Police Department, and Greene County Sheriff’s Department He is survived by his wife, three daughters, mother, and two brothers.",
        "age":"44",
        "tour":"23 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"30.9215764",
        "lon":"-88.5058196"
    },
    {
        "name":"Lieutenant David J. McShane",
        "officer_name":"David J. McShane",
        "title":"Lieutenant",
        "department_name":"New York State Environmental Conservation Police",
        "state_abbreviation":"NY",
        "cause":"9\/11 related illness",
        "date":"2024-01-23",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26910-lieutenant-david-j-mcshane",
        "photo_url":"26910\/125\/c_david-mcshane.jpg",
        "incident_description":"Lieutenant David McShane died as the result of cancer that he developed following his assignment to the search and recovery efforts at the World Trade Center site following the 9\/11 Terrorist Attacks.\n\nLieutenant McShane had served with the New York State Environmental Conservation Police for 23 years. He was survived by his wife, three children, his mother, three sisters, and three brothers.",
        "age":"50",
        "tour":"23 years",
        "badge":"399",
        "weapon":"Aircraft; Passenger jet",
        "offender":"19 suicide attackers",
        "lat":"40.7119779",
        "lon":"-74.0133405"
    },
    {
        "name":"Trooper Joel Popp",
        "officer_name":"Joel Popp",
        "title":"Trooper",
        "department_name":"Michigan State Police",
        "state_abbreviation":"MI",
        "cause":"Struck by vehicle",
        "date":"2024-01-24",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26898-trooper-joel-popp",
        "photo_url":"26898\/125\/trooper-joel-popp.jpg",
        "incident_description":"Trooper Joel Popp was struck and killed by a vehicle while assisting with a DUI investigation on northbound I-75 near Birch Run at about 7:10 pm.\n\nHe was standing outside of his vehicle when another motorist struck him and two patrol cars. Trooper Popp was transported to Hurley Medical Center where he succumbed to his injuries.\n\nThe 81-year-old driver sustained serious injuries. \n\nTrooper Popp had served with the Michigan State Police for four years and was assigned to the Tri-City Post. He is survived by his wife, daughter, parents, two brothers, and grandparents.",
        "age":"39",
        "tour":"4 years",
        "badge":"1779",
        "weapon":null,
        "offender":null,
        "lat":"43.2427336",
        "lon":"-83.7697516"
    },
    {
        "name":"Sergeant Michael \"Zini\" Kurinzi",
        "officer_name":"Michael \"Zini\" Kurinzi",
        "title":"Sergeant",
        "department_name":"Elizabeth Police Department",
        "state_abbreviation":"NJ",
        "cause":"9\/11 related illness",
        "date":"2024-01-27",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26920-sergeant-michael-zini-kurinzi",
        "photo_url":"26920\/125\/c_kurinzi_m.jpg",
        "incident_description":"Sergeant Mike Kurinzi died as the result of cancer that he developed following his assignment to the search and recovery efforts at the World Trade Center site following the 9\/11 Terrorist Attacks.\n\nSergeant Kurinzi was a United States Marine Corps veteran and had served with the Elizabeth Police Department for 20 years. He is survived by his wife, son, and daughter.",
        "age":"51",
        "tour":"20 years",
        "badge":"Not available",
        "weapon":"Aircraft; Passenger jet",
        "offender":"19 suicide attackers",
        "lat":"40.7117483",
        "lon":"-74.0134658"
    },
    {
        "name":"Trooper Jimmy Cenescar",
        "officer_name":"Jimmy Cenescar",
        "title":"Trooper",
        "department_name":"Georgia State Patrol",
        "state_abbreviation":"GA",
        "cause":"Automobile crash",
        "date":"2024-01-28",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26908-trooper-jimmy-cenescar",
        "photo_url":"26908\/125\/c_tpr_cenescar_odmp_photo.jpg",
        "incident_description":"Trooper Jimmy Cenescar was killed in a single-vehicle crash attempting to stop a fleeing motorcycle on Interstate 85 North at 5:39 p.m. \n\nWhile pursuing a motorcycle for a traffic violation, Trooper Cenescar lost control of his patrol vehicle near Old Peachtree Road in Atlanta while maneuvering to avoid putting other drivers in danger. The motorcycle was traveling up to speeds of 140 miles per hour and weaving erratically between lanes. When the motorcycle made another lane split with vehicles in both lanes, Trooper Cenescar took evasive action to avoid the other vehicles, and his vehicle left the road and struck an embankment. He was transported to Northside Gwinnett Hospital where he succumbed to his injuries.  \n\nThe motorcycle driver continued to flee northbound. The subject was arrested a few days later and charged with felony murder, first-degree homicide, felony fleeing and attempting to elude, and reckless driving. He was sentenced to twenty years, with 17 years in prison, after pleading guilty to vehicular homicide, reckless driving, speeding, two counts each of driving without a license, operating a vehicle without insurance, and operating an unregistered vehicle. \n\nTrooper Cenescar had served with the Georgia State Patrol for one year, assigned to Post 9, Marietta. He previously served with the Atlanta Police Department for two years. He is survived by his parents, sister, three brothers, grandmother, cousins, and fiancée.",
        "age":"28",
        "tour":"3 years",
        "badge":"436",
        "weapon":"Automobile",
        "offender":"20 years",
        "lat":"34.0333881",
        "lon":"-84.0438670"
    },
    {
        "name":"Trooper Zachary Fink",
        "officer_name":"Zachary Fink",
        "title":"Trooper",
        "department_name":"Florida Highway Patrol",
        "state_abbreviation":"FL",
        "cause":"Automobile crash",
        "date":"2024-02-02",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26913-trooper-zachary-fink",
        "photo_url":"26913\/125\/c_fink.jpg",
        "incident_description":"Trooper Zachary Fink was killed in a vehicle crash during a pursuit on Interstate 95 north at Crosstown Parkway near Port St. Lucie at 3:00 a.m. \n\nAt 2:40 am, the subject was speeding and reckless driving on I-95, and St. Lucie deputies attempted to initiate a traffic stop. Other agencies joined the pursuit when the subject did not stop. The subject made a U-turn on Interstate 95, driving southbound in the northbound lanes on I-95. Trooper Fink initiated a U-turn to stop the vehicle and was struck by a semi-tractor trailer. \n\nTrooper Fink was transported to HCA Lawnwood Hospital where he succumbed to his injuries. The driver of the tractor-trailer was also killed. \n\nThe pursuit continued, with the subject driving the wrong way on I-95. He eventually crashed and fled on foot. He was apprehended at 8:06 a.m.\n\nTrooper Fink had served with the Florida Highway Patrol for three years. He is survived by his mother, father, and fiancée.",
        "age":"26",
        "tour":"3 years",
        "badge":"1550",
        "weapon":"Automobile",
        "offender":"In custody",
        "lat":"27.2944365",
        "lon":"-80.4173684"
    },
    {
        "name":"Chief Deputy Sheriff Ken Prorok",
        "officer_name":"Chief   Ken Prorok",
        "title":"Deputy",
        "department_name":"Moody County Sheriff's Office",
        "state_abbreviation":"SD",
        "cause":"Struck by vehicle",
        "date":"2024-02-02",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26914-chief-deputy-sheriff-ken-prorok",
        "photo_url":"26914\/125\/c_prorok-ken.jpg",
        "incident_description":"Chief Deputy Sheriff Ken Prorok was struck and killed by the driver of a vehicle being pursued by the Madison Police Department at 4:12 p.m. \n\nChief Deputy Prorok responded to the call for assistance and was deploying spike strips at South Dakota Highway 34 and 472nd Avenue in Colman. The driver intentionally swerved toward Chief Deputy Prorok, killing him. \n\nThe subject has been charged with one count of first-degree murder and one count of aggravated eluding.  \n\nChief Deputy Prorok had served with the Moody County Sheriff's Office for almost eight years. He is survived by his wife, a son, and two daughters.",
        "age":"51",
        "tour":"7 years, 11 months",
        "badge":"52-1B",
        "weapon":"Automobile",
        "offender":"Charged with murder",
        "lat":"43.9788171",
        "lon":"-96.7687281"
    },
    {
        "name":"Deputy Sheriff Timothy Tavarus Rivers",
        "officer_name":"Timothy Tavarus Rivers",
        "title":"Deputy",
        "department_name":"Crawford County Sheriff's Office",
        "state_abbreviation":"GA",
        "cause":"Automobile crash",
        "date":"2024-02-06",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26924-deputy-sheriff-timothy-tavarus-rivers",
        "photo_url":"26924\/125\/deputy-sheriff-timothy-rivers.png",
        "incident_description":"Deputy Sheriff Timothy Rivers was killed in a vehicle crash on Marshall Mill Road, south of Chapman Road in Lizella.\n\nAt 10:09 p.m., Deputy Rivers was responding to an officer assistance call, traveling southbound, when his patrol car crossed the center line. When he attempted to correct his path, he hit another vehicle. He was transported to Atrium Health Navicent Medical Center where he succumbed to his injuries. \n\nDeputy Rivers had served with the Crawford County Sheriff's Office for two years. He is survived by his four children, parents, three siblings, grandmother, nieces, nephews, and fiancée.",
        "age":"40",
        "tour":"2 years",
        "badge":"333",
        "weapon":null,
        "offender":null,
        "lat":"32.7491483",
        "lon":"-83.8475622"
    },
    {
        "name":"Deputy Sheriff Christopher Johnson",
        "officer_name":"Christopher Johnson",
        "title":"Deputy",
        "department_name":"Harnett County Sheriff's Office",
        "state_abbreviation":"NC",
        "cause":"Automobile crash",
        "date":"2024-02-06",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26923-deputy-sheriff-christopher-johnson",
        "photo_url":"26923\/125\/c_johnson_chris.jpg",
        "incident_description":"Deputy Sheriff Chris Johnson was killed in a three-vehicle crash on Darroch Road in Lillington at 2:56 p.m.\n\nDeputy Johnson had left Highland Middle School and was on his way to another school when he collided with a tractor-trailer. His patrol vehicle was thrown into multiple vehicles. He died at the scene. \n\nJohnson was with the Harnett County Sheriff’s Office for 16 months and was the Student Resource Officer at Highland Middle School. He previously served with the Sampson County Sheriff’s Office for 16 years and the Dunn Police Department for 9 years. He is survived by his wife, four children, and father.",
        "age":"51",
        "tour":"26 years",
        "badge":"J26",
        "weapon":null,
        "offender":null,
        "lat":"35.3255380",
        "lon":"-78.9342359"
    },
    {
        "name":"Deputy Sheriff Greg McCowan",
        "officer_name":"Greg McCowan",
        "title":"Deputy",
        "department_name":"Blount County Sheriff's Office",
        "state_abbreviation":"TN",
        "cause":"Gunfire",
        "date":"2024-02-08",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26925-deputy-sheriff-greg-mccowan",
        "photo_url":"26925\/125\/c_mcgowan.jpg",
        "incident_description":"Deputy Sheriff Greg McCowan was shot and killed while backing up another deputy during a traffic stop at 4959 Sevierville Road in Maryville. \n\nAround 8:00 p.m., a deputy pulled over a vehicle for erratic driving. After initial contact, the deputy called Deputy McCowan for backup. The driver would not cooperate and shot Deputy McCowan multiple times and the deputy in the leg. The deputy returned fire, but the subject fled in his vehicle.\n\nDeputy McCowan was taken to Blount Memorial Hospital where he succumbed to his wounds. The other deputy was treated at the hospital and released. \n\nThe subject, who is a convicted felon, was apprehended five days later. The felon's brother and girlfriend were arrested and charged with aiding the defendant after the commission of the homicide.\n\nDeputy McCowan had served with the Blount County Sheriff's Office for four years. He is survived by two children, one granddaughter, his mother, his father, and a fiancée.",
        "age":"43",
        "tour":"4 years",
        "badge":"344",
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"35.8213235",
        "lon":"-83.8199767"
    },
    {
        "name":"Deputy Sheriff Rondald Bates",
        "officer_name":"Rondald Bates",
        "title":"Deputy",
        "department_name":"Harris County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Automobile crash",
        "date":"2024-02-10",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26934-deputy-sheriff-rondald-bates",
        "photo_url":"26934\/125\/c_deputy_bates.jpg",
        "incident_description":"Deputy Sheriff Rondald Bates was killed in a vehicle crash while en route to the Harris County jail at 10:00 p.m.\n\nAfter finishing an overtime assignment, Deputy Bates was traveling on Travis Street when he lost control of his vehicle and struck a tree near Richmond Avenue in Houston. He was transported to the Ben Taub Hospital where he succumbed to his injuries. \n\nDeputy Bates had served with the Harris County Sheriff's Office for 31 years. He is survived by his wife and two children.",
        "age":"62",
        "tour":"31 years",
        "badge":"2729",
        "weapon":null,
        "offender":null,
        "lat":"29.7343985",
        "lon":"-95.3839119"
    },
    {
        "name":"Patrol Officer Jonah Hernandez",
        "officer_name":"Patrol  Jonah Hernandez",
        "title":"Officer",
        "department_name":"Las Cruces Police Department",
        "state_abbreviation":"NM",
        "cause":"Stabbed",
        "date":"2024-02-11",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26933-patrol-officer-jonah-hernandez",
        "photo_url":"26933\/125\/c_jonah-hernandez.jpg",
        "incident_description":"Patrol Officer Jonah Hernandez was stabbed to death while responding to a trespassing call at the 300 block of South Valley Drive in Las Cruces. \n\nA witness to the stabbing shot the suspect while another witness called 911 for help.  \n\nOfficer Hernandez was transported to MountainView Regional Medical Center where he died from a knife wound to his neck.  \n\nThe subject had a lengthy criminal record and mental illness. \n\nOfficer Hernandez had served with the Las Cruces Police Department for two years. He was survived by his wife and two sons.",
        "age":"35",
        "tour":"2 years",
        "badge":"989",
        "weapon":"Edged weapon",
        "offender":"Shot and killed",
        "lat":"32.3041203",
        "lon":"-106.7924800"
    },
    {
        "name":"Sergeant Nevada Krinkee",
        "officer_name":"Nevada Krinkee",
        "title":"Sergeant",
        "department_name":"Sheridan Police Department",
        "state_abbreviation":"WY",
        "cause":"Gunfire",
        "date":"2024-02-13",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26938-sergeant-nevada-krinkee",
        "photo_url":"26938\/125\/c_krinkee_nevada.jpg",
        "incident_description":"Sergeant Nevada Krinkee was shot and killed while serving a trespass warning near 5th Street and Val Vista Street in Sheridan.\n\nSergeant Krinkee was transported to Sheridan Memorial Hospital where he succumbed to his wounds. \n\nThe subject, who had a lengthy criminal record, fled and barricaded himself inside a residence. After a 30-hour standoff, the subject refused to surrender, attempted to flee, and was shot and killed.  \n\nSergeant Krinkee was a United States Army veteran and had served with the Sheridan Police Department for over six years. He is survived by his wife, who also served with the Sheridan Police Department, and a daughter.",
        "age":"33",
        "tour":"6 years, 6 months",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"44.8069514",
        "lon":"-106.9571450"
    },
    {
        "name":"Deputy Sheriff Robert John Leonard",
        "officer_name":"Robert John Leonard",
        "title":"Deputy",
        "department_name":"Meigs County Sheriff's Office",
        "state_abbreviation":"TN",
        "cause":"Drowned",
        "date":"2024-02-14",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26950-deputy-sheriff-robert-john-leonard",
        "photo_url":"26950\/125\/deputy-sheriff-robert-leonard.jpg",
        "incident_description":"Deputy Sheriff R.J. Leonard died in a single-vehicle crash into the Tennessee River off the Blythe Ferry Boat Ramp in Birchwood.\n\nDeputy Leonard was at home when he took the call relating to a disturbance near the Highway 60 Bridge in Birchwood. He arrived at the scene at about 9:48 p.m. and, at 10:15 pm, radioed that he had arrested a female subject and was transporting her to the Meigs County Jail. A few moments later, dispatchers received an unclear transmission where Deputy Leonard mentioned \"water.\" The area is remote and rural, and it is difficult for cellphone signals and other radio traffic to go through. When he failed to respond to a status check, a search began. \n\nThe next day, his patrol car was found upside down in the water with the female subject in the back. His window was rolled down, and he was not in the vehicle. His body was recovered at 6:30 p.m. on February 15, 2024. \n\nDeputy Leonard had served with the Meigs County Sheriff's Office for two months. He is survived by his wife, five children, mother, and two siblings.",
        "age":"35",
        "tour":"2 months",
        "badge":"807",
        "weapon":null,
        "offender":null,
        "lat":"35.4095594",
        "lon":"-85.0087632"
    },
    {
        "name":"Police Officer Paul Elmstrand",
        "officer_name":"Paul Elmstrand",
        "title":"Police",
        "department_name":"Burnsville Police Department",
        "state_abbreviation":"MN",
        "cause":"Gunfire",
        "date":"2024-02-18",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26951-police-officer-paul-elmstrand",
        "photo_url":"26951\/125\/police-officer-paul-elmstrand.jpg",
        "incident_description":"Police Officer Paul Elmstrand and Police Officer Matthew Ruge were shot and killed after responding to a domestic incident in the 12600 block of 33rd Avenue at about 2:00 am.\n\nA man who was a convicted felon had taken several family members hostage, including seven children, and barricaded himself inside the home.\n\nOfficer Ruge, Officer Elmstrand, and two other officers had been negotiating inside the house with the man, who claimed to be unarmed. After three and a half hours of negotiation, the subject fired on the officers suddenly at 5:26 a.m. Two officers returned fire, wounding the subject in the leg. While Officer Ruge and a Burnsville Police Department sergeant were exiting the home, they were struck a second time. Burnsville Firefighter\/Paramedic Adam Finseth was shot while he was trying to help the wounded officers to an armored vehicle. The man continued to shoot at officers from an upstairs window.\n\nOfficer Ruge, Officer Elmstraud, and Paramedic Finseth were transported to Hennepin County Medical Center where they succumbed to their wounds. The sergeant was treated and released.\n\nThe man committed suicide and was found deceased in the home at about 10:15 am. The investigation revealed that the subject fired more than 100 rounds at the officers. The hostages were able to escape safely.\n\nOfficer Elmstrand had served as a sworn officer with the Burnsville Police Department for five years and had previously served as a community service officer. He is survived by his wife and two young children.",
        "age":"27",
        "tour":"5 years",
        "badge":"176",
        "weapon":"Gun; Unknown type",
        "offender":"Committed suicide",
        "lat":"44.7762164",
        "lon":"-93.2309188"
    },
    {
        "name":"Police Officer Matthew Henke Ruge",
        "officer_name":"Matthew Henke Ruge",
        "title":"Police",
        "department_name":"Burnsville Police Department",
        "state_abbreviation":"MN",
        "cause":"Gunfire",
        "date":"2024-02-18",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26952-police-officer-matthew-henke-ruge",
        "photo_url":"26952\/125\/officer-matthew-ruge.jpg",
        "incident_description":"Police Officer Matthew Ruge and Police Officer Paul Elmstrand were shot and killed after responding to a domestic incident in the 12600 block of 33rd Avenue at about 2:00 am.\n\nA man who was a convicted felon had taken several family members hostage, including seven children, and barricaded himself inside the home. \n\nOfficer Ruge, Officer Elmstrand, and two other officers had been negotiating inside the house with the man, who claimed to be unarmed. After three and a half hours of negotiation, the subject fired on the officers suddenly at 5:26 a.m. Two officers returned fire, wounding the subject in the leg. While Officer Ruge and a Burnsville Police Department sergeant were exiting the home, they were struck a second time. Burnsville Firefighter\/Paramedic Adam Finseth was shot while he was trying to help the wounded officers to an armored vehicle. The man continued to shoot at officers from an upstairs window. \n\nOfficer Ruge, Officer Elmstraud, and Paramedic Finseth were transported to Hennepin County Medical Center where they succumbed to their wounds. The sergeant was treated and released.  \n\nThe man committed suicide and was found deceased in the home at about 10:15 am. The investigation revealed that the subject fired more than 100 rounds at the officers. The hostages were able to escape safely. \n\nOfficer Ruge had served with the Burnsville Police Department for four years. He is survived by his parents and sister.",
        "age":"27",
        "tour":"4 years",
        "badge":"183",
        "weapon":"Gun; Unknown type",
        "offender":"Committed suicide",
        "lat":"44.7762164",
        "lon":"-93.2309188"
    },
    {
        "name":"Trooper First Class Chase Winston Redner",
        "officer_name":"Chase Winston Redner",
        "title":"Trooper",
        "department_name":"Georgia State Patrol",
        "state_abbreviation":"GA",
        "cause":"Struck by vehicle",
        "date":"2024-02-20",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26953-trooper-first-class-chase-winston-redner",
        "photo_url":"26953\/125\/c_tfc-redner-.jpg",
        "incident_description":"Trooper First Class Chase Redner was struck and killed while investigating a fatal pedestrian crash scene at Interstate 75 North near Mt. Zion Boulevard in Morrow.  \n\nAt 10:30 p.m. on February 19, 2024, a construction worker died after being struck by a vehicle while setting up a work zone. Trooper Redner was investigating the collision site and was standing outside his patrol cruiser at 12:30 a.m. when he was hit by a passing vehicle. He was transported to Grady Memorial Hospital where he died from his injuries. \n\nTrooper Redner had served with the Georgia State Patrol for over six years. He is survived by his mother and fiancée.",
        "age":"31",
        "tour":"6 years, 5 months",
        "badge":"290",
        "weapon":null,
        "offender":null,
        "lat":"33.5617629",
        "lon":"-84.3146812"
    },
    {
        "name":"Deputy Sheriff Charles Rivette",
        "officer_name":"Charles Rivette",
        "title":"Deputy",
        "department_name":"Montgomery County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Automobile crash",
        "date":"2024-02-21",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26954-deputy-sheriff-charles-rivette",
        "photo_url":"26954\/125\/c_charles-rivette.jpg",
        "incident_description":"Deputy Sheriff Charles Rivette was killed in a crash on southbound Interstate 45 in Centerville, Texas, at 10:30 p.m.\n\nDeputy Rivette was a passenger in a patrol vehicle transporting an inmate from Oklahoma to Montgomery County when it struck a tractor-trailer. Unable to stop, two tractor-trailers crashed into the back of the patrol vehicle. The impact forced the vehicle into the northbound lanes. Deputy Rivette was thrown out of the vehicle and was hit by a pickup truck traveling in the northbound lanes. The other deputy, the inmate, and one of the tractor-trailer drivers also suffered serious injuries. \n\nDeputy Rivette had served with the Montgomery County Sheriff's Office for 18 years. He is survived by his wife and children. His son also serves with the agency.",
        "age":"40",
        "tour":"18 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"31.3794698",
        "lon":"-96.0215314"
    },
    {
        "name":"Police Officer Wisbens Antoine",
        "officer_name":"Wisbens Antoine",
        "title":"Police",
        "department_name":"Knoxville Police Department",
        "state_abbreviation":"TN",
        "cause":"Duty related illness",
        "date":"2024-02-25",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26957-police-officer-wisbens-antoine",
        "photo_url":"26957\/125\/c_officer-wisbens-antoine.jpg",
        "incident_description":"Police Officer Wisbens Antoine passed away after collapsing at the completion of a 1.5-mile run during Basic Recruit Training at 1650 Huron Street in Knoxville on February 23, 2024.\n\nThe training staff provided life-saving measures until he could be transported to UT Medical Center. His condition worsened, and he passed away on February 25, 2024. \n\nOfficer Antoine had served with the Knoxville Police Department for one day. He was a member of the 2023-B Basic Recruit Class. He is survived by his wife and two children.",
        "age":"32",
        "tour":"1 day",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"35.9924237",
        "lon":"-83.9269698"
    },
    {
        "name":"Officer Cody Allen",
        "officer_name":"Cody Allen",
        "title":"Officer",
        "department_name":"Independence Police Department",
        "state_abbreviation":"MO",
        "cause":"Gunfire",
        "date":"2024-02-29",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26958-officer-cody-allen",
        "photo_url":"26958\/125\/officer-cody-allen.jpg",
        "incident_description":"Officer Cody Allen was shot and killed at 1100 N Elsea Smith Road while responding to the shooting of Civil Process Server Drexel Mack, of the 16th Judicial Circuit Court of Jackson County, at about 1:00 pm.\n\nMr. Mack and several other process servers were serving an eviction notice at the residence when an occupant opened fire, wounding him. The other court officers and a neighbor called 911 following the initial shooting. As Officer Allen and other Independence police officers arrived at the scene, they attempted to rescue Mr. Mack, but also were fired upon. Officer Allen suffered fatal gunshot wounds while the other two suffered non-fatal wounds.\n\nMr. Mack also succumbed to his wounds.\n\nThe subject was taken into custody a short time later.\n\nOfficer Allen had served with the Independence Police Department for six years and had served in law enforcement for 15 years. He had previously served with the Grandview Police Department for six years and the Lafayette County Sheriff's Office for seven years. He is survived by his wife and two children.",
        "age":"35",
        "tour":"15 years",
        "badge":"1598",
        "weapon":"Gun; Unknown type",
        "offender":"Apprehended",
        "lat":"39.1199737",
        "lon":"-94.2629231"
    },
    {
        "name":"Trooper Christopher M. Gadd",
        "officer_name":"Christopher M. Gadd",
        "title":"Trooper",
        "department_name":"Washington State Patrol",
        "state_abbreviation":"WA",
        "cause":"Automobile crash",
        "date":"2024-03-02",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26961-trooper-christopher-m-gadd",
        "photo_url":"26961\/125\/c_trooper-christopher-m.-gadd.jpg",
        "incident_description":"Trooper Christopher Gadd was killed when his patrol car was struck by another vehicle while he was parked on the shoulder of I-5, near 136th Street NE in Marysville, at about 3:00 am.\n\nHe was conducting DUI enforcement patrols when the crash occurred. The vehicle that struck him was traveling at a high rate of speed when he drove into the back of his patrol car. Then, the vehicle ricocheted off his patrol vehicle and was hit by a van. \n\nThe driver, who is in the United States illegally, has an eleven-year history of convictions for driving with a suspended license, multiple tickets for speeding more than 49 mph over the speed limit, several orders of protection for domestic violence, and failing to make court appearances. Multiple times, he was granted non-felony plea deals for felonious crimes. He was arrested and charged with vehicular homicide and vehicular assault while awaiting toxicology reports.\n\nTrooper Gadd had served with the Washington State Patrol for 2-1\/2 years. He is survived by his wife, 2-year-old daughter, parents, and sister. His father also serves with the Washington State Patrol, and his sister serves with the Texas Highway Patrol.",
        "age":"27",
        "tour":"2 years, 6 months",
        "badge":"927",
        "weapon":null,
        "offender":null,
        "lat":"48.1185183",
        "lon":"-122.1853089"
    },
    {
        "name":"Deputy Sheriff Bryan \"Brad\" Sweetman",
        "officer_name":"Bryan \"Brad\" Sweetman",
        "title":"Deputy",
        "department_name":"Harris County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Duty related illness",
        "date":"2024-03-04",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27067-deputy-sheriff-bryan-brad-sweetman",
        "photo_url":"27067\/125\/c_brad_sweetman_2024.jpg",
        "incident_description":"Deputy Sheriff Brad Sweetman died from the effects of chemical exposure while providing traffic control during multi-day evacuations around the area of a chemical plant explosion in Crosby.\n\nIn August 2017, Hurricane Harvey caused devastating flooding, and as a result, the Arkema Chemical Plant's refrigeration system failed, forcing the evacuation of people within the radius of the plant. A couple of days later, emergency responders encountered a cloud of gas and went to the hospital for exposure to smoke, headaches, and nausea. Later that night, one of the trailers ignited, and the fires burned for three days. \n\nDeputy Sweetman suffered lung damage and respiratory issues until he passed away on March 4, 2024.  \n\nDeputy Sweetman had served with the Harris County Sheriff's Office for 39 years. He was survived by his wife, son, daughter, sister, brother, and grandson.",
        "age":"68",
        "tour":"39 years",
        "badge":"3101",
        "weapon":null,
        "offender":null,
        "lat":"29.9442204",
        "lon":"-95.0228852"
    },
    {
        "name":"Border Patrol Agent Christopher Luna",
        "officer_name":"Border Patrol  Christopher Luna",
        "title":"Agent",
        "department_name":"United States Department of Homeland Security - Customs and Border Protection - United States Border Patrol",
        "state_abbreviation":"US",
        "cause":"Aircraft accident",
        "date":"2024-03-08",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26974-border-patrol-agent-christopher-luna",
        "photo_url":"26974\/125\/c_christopher-luna.jpg",
        "incident_description":"Border Patrol Agent Chris Luna was killed in a helicopter crash along with two members of the New York National Guard in Starr County, Texas.\n\nThe New York National Guard UH-72 Lakota helicopter was supporting the Department of Homeland Security as part of Joint Task Force North. Agent Luna was onboard the military aircraft when it crashed just north of the Rio Grande River, approximately two miles southeast of La Grulla, Texas. Chief Warrant Officer 2 Casey Frankoski and Chief Warrant Officer 2 John Grassia were also killed in the crash, while a third service member was injured. CWO2 Grassia was on active duty with the New York National Guard from his full-time position as a trooper with the New York State Police.\n\nAgent Luna was survived by his wife, two children, parents, and brother.",
        "age":"51",
        "tour":"Not available",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"26.2527794",
        "lon":"-98.6146536"
    },
    {
        "name":"Chief of Police William Anthony Anderson, Sr.",
        "officer_name":"Chief of  William Anthony Anderson, Sr.",
        "title":"Police",
        "department_name":"Northeast Mississippi Community College Police Department",
        "state_abbreviation":"MS",
        "cause":"Heart attack",
        "date":"2024-03-09",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26990-chief-of-police-william-anthony-anderson-sr",
        "photo_url":"26990\/125\/c_nemcc_anthonyanderson.jpg",
        "incident_description":"Chief of Police Anthony Anderson suffered a fatal heart attack while working extra hours at the National Junior College Athletics Association (NJCAA) Basketball Tournament game at the Bonner Arnold Coliseum in Booneville. \n\nChief Anderson had been working his regular hours and added the additional college tournament games to his schedule, as well as high school and junior high games. He was working his fifth game in four days when he collapsed at 2:30 p.m. Despite life-saving measures, he was unable to be revived. \n\nChief Anderson had served with the Northeast Mississippi Community College Campus Police for almost ten years and previously served as the Chief of Police of the Verona Police Department and with the Union County Sheriff's Office. He is survived by his wife, two daughters, a son, and three grandchildren.",
        "age":"61",
        "tour":"24 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"34.6684744",
        "lon":"-88.5638870"
    },
    {
        "name":"Sergeant Thomas A. Sanfratello",
        "officer_name":"Thomas A. Sanfratello",
        "title":"Sergeant",
        "department_name":"Genesee County Sheriff's Office",
        "state_abbreviation":"NY",
        "cause":"Assault",
        "date":"2024-03-10",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26975-sergeant-thomas-a-sanfratello",
        "photo_url":"26975\/125\/c_thomas-sanfratello.jpg",
        "incident_description":"Sergeant Thomas Sanfratello died after being attacked after responding to a dispute between two patrons at one of the Batavia Downs Casino's bars at 8315 Park Road in Batavia.\n\nOne of the patrons was arrested at about 12:30 am and was being escorted from the establishment by Sergeant Sanfratello and security when the second patron attacked him. A violent struggle ensued, during which Sergeant Sanfratello attempted to use his taser on the subject. Sergeant Sanfratello became unresponsive and died despite security personnel and bystanders administering CPR.\n\nOne subject was charged with first-degree aggravated manslaughter, aggravated assault upon a police officer, and second-degree burglary. The second subject was charged with second-degree burglary and attempted second-degree assault. \n\nSergeant Sanfratello had served with the Genesee County Sheriff's Office for 32 years and had twice been recognized as Officer of the Year. He is survived by his son, two daughters, mother, two sisters, nieces, and nephews.",
        "age":"54",
        "tour":"32 years",
        "badge":"GS09",
        "weapon":"Person",
        "offender":"Arrested",
        "lat":"43.0096108",
        "lon":"-78.2051398"
    },
    {
        "name":"Patrolman Justin Hare",
        "officer_name":"Justin Hare",
        "title":"Patrolman",
        "department_name":"New Mexico State Police",
        "state_abbreviation":"NM",
        "cause":"Gunfire",
        "date":"2024-03-15",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26980-patrolman-justin-hare",
        "photo_url":"26980\/125\/patrolman-justin-hare.jpg",
        "incident_description":"Patrolman Justin Hare was shot and killed at about 5:30 am while conducting a welfare check on a disabled vehicle that was stopped near mile marker 320 on I-40, west of Tucumcari.\n\nAs Patrolman Hare stopped behind the vehicle, the driver exited and walked to the cruiser's passenger window. The two had a short discussion, and as Patrolman Hare offered to drive the man into town, the subject suddenly produced a handgun and shot him. He shot him a second time before pushing him into the passenger seat. He then abducted him and stole the patrol car, abandoning it approximately 16 miles away and fleeing on foot.\n\nPatrolman Hare was taken to a local hospital where he succumbed to his wounds two hours later.\n\nUnbeknownst to Patrolman Hare, the man was the suspect in the murder of an off-duty paramedic in South Carolina several days earlier. The car he was driving belonged to the murder victim. The subject was arrested two days later after exchanging gunfire with a Bernalillo County sheriff's deputy.\n\nPatrolman Hare had served with the New Mexico State Police for six years. He is survived by his girlfriend, two children, mother, father, and brother.",
        "age":"35",
        "tour":"6 years",
        "badge":"Not available",
        "weapon":"Handgun",
        "offender":"In custody",
        "lat":"35.1237835",
        "lon":"-103.9273681"
    },
    {
        "name":"Detective Jonathan Diller",
        "officer_name":"Jonathan Diller",
        "title":"Detective",
        "department_name":"New York City Police Department",
        "state_abbreviation":"NY",
        "cause":"Gunfire",
        "date":"2024-03-25",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26983-detective-jonathan-diller",
        "photo_url":"26983\/125\/c_jonathan-diller.jpg",
        "incident_description":"Detective Jonathan Diller was shot and killed during a traffic stop near 19-19 Mott Avenue in the Far Rockaway area of New York City. \n\nAt 5:50 p.m., Detective Diller and his partner approached a vehicle that was stopped in front of a bus stop. Despite being asked numerous times to exit the vehicle, the subject refused. He pulled out a gun and shot Detective Diller in the stomach, striking him under his vest. Detective Diller was able to get the gun away from the subject, and his partner wounded the suspect. \n\nDetective Diller was transported to Jamaica Hospital where he succumbed to his wounds. \n\nThe subject, who had an extensive criminal record, was taken to Jamaica Hospital and is in stable condition. \n\nDetective Diller had served with the New York City Police Department for three years and was assigned to Patrol Borough Queens South Community Response Team. He is survived by his wife and one-year-old son.\n\nHe was posthumously promoted to Detective First Grade and given a new shield number, 110, his son's birthday.",
        "age":"31",
        "tour":"3 years",
        "badge":"110",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and wounded",
        "lat":"40.6039446",
        "lon":"-73.7522307"
    },
    {
        "name":"Deputy Sheriff Christina Musil",
        "officer_name":"Christina Musil",
        "title":"Deputy",
        "department_name":"DeKalb County Sheriff's Office",
        "state_abbreviation":"IL",
        "cause":"Vehicular assault",
        "date":"2024-03-29",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26985-deputy-sheriff-christina-musil",
        "photo_url":"26985\/125\/deputy-sheriff-christina-musil.jpg",
        "incident_description":"Deputy Sheriff Christina Musil was killed when her patrol car was struck by a commercial vehicle on Illinois 23 south of Perry Road at about 10:40 pm.\n\nShe was parked on the shoulder of the roadway when the approaching vehicle struck the rear of the patrol car. She was transported to a local hospital where she succumbed to her injuries.\n\nThe driver was originally cited for failing to reduce speed to avoid an accident, improper lane usage, and operating an uninsured motor vehicle But six days later, he was charged with three counts of aggravated DUI and one count of reckless homicide.\n\nDeputy Musil was an Illinois Army National Guard Military Police Afghanistan War veteran and had served with the DeKalb County Sheriff's Office for five years. She is survived by her three children, parents, brother, and sister.",
        "age":"35",
        "tour":"9 years",
        "badge":"42",
        "weapon":"Automobile; Narcotics involved",
        "offender":"Charged with reckless homicide",
        "lat":"41.8489307",
        "lon":"-88.7539283"
    },
    {
        "name":"Agent Eliezer Ramos-Velez",
        "officer_name":"Eliezer Ramos-Velez",
        "title":"Agent",
        "department_name":"Puerto Rico Police Department",
        "state_abbreviation":"PR",
        "cause":"Gunfire",
        "date":"2024-03-29",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26986-agent-eliezer-ramos-velez",
        "photo_url":"26986\/125\/c_eliezer-ramos-velez-1.jpg",
        "incident_description":"Agent Eliezer Ramos-Velez was shot and killed while following several off-road vehicles whose riders had been shooting guns in the air and at passing cars along PR 26 at about 4:00 am.\n\nHe was on his way home from his shift, driving his personal vehicle but still in uniform, when he witnessed the motorcycle and ATV riders shooting at vehicles as they drove along the highway. Agent Ramos-Velez radioed in the event and followed the vehicle along the highway and updated dispatchers as they turned into the Sabana Abajo Housing Project along Monserrate Avenue.\n\nAfter dispatchers received no additional radio contact from Agent Ramos-Velez, officers located his body in the driver's seat of his vehicle inside the housing complex. His service weapon and police radio had been stolen. The suspects remain at large.\n\nAgent Ramos-Velez had served with the Puerto Rico Police Department for 12 years. He is survived by his girlfriend and infant son.",
        "age":"35",
        "tour":"12 years",
        "badge":"36516",
        "weapon":"Gun; Unknown type",
        "offender":"At large",
        "lat":"18.4076572",
        "lon":"-65.9782577"
    },
    {
        "name":"Lead Police Officer Adam Buckner",
        "officer_name":"Lead   Adam Buckner",
        "title":"Police",
        "department_name":"Tucson Police Department",
        "state_abbreviation":"AZ",
        "cause":"Automobile crash",
        "date":"2024-03-31",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26987-lead-police-officer-adam-buckner",
        "photo_url":"26987\/125\/c_buckner_adam.jpg",
        "incident_description":"Lead Police Officer Adam Buckner was struck and killed in a vehicle crash while responding to a call for service. \n\nAround 10:00 p.m., Officer Buckner was traveling north on Campbell Avenue in Tucson with emergency lights and sirens activated. As he went through the green light at the intersection at East 6th Street, a vehicle failed to yield and turned into his patrol car. \n\nHe was transported to Banner University Medical Center where he succumbed to his injuries. \n\nOfficer Buckner had served with the Tucson Police Department for over two years and previously served with the New Orleans Police Department (Louisiana) for four years. He is survived by his wife, mother, brothers, and sisters.",
        "age":"31",
        "tour":"6 years, 5 months",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"32.2278937",
        "lon":"-110.9438659"
    },
    {
        "name":"Deputy Sheriff Jermyius O’Marian-D’Nazhray Young",
        "officer_name":"Jermyius O’Marian-D’Nazhray Young",
        "title":"Deputy",
        "department_name":"Montgomery County Sheriff's Office",
        "state_abbreviation":"AL",
        "cause":"Automobile crash",
        "date":"2024-04-05",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26989-deputy-sheriff-jermyius-omarian-dnazhray-young",
        "photo_url":"26989\/125\/c_deputy_sheriff_jermyius_young.jpg",
        "incident_description":"Deputy Sheriff Jermyius Young succumbed to injuries he received in a single-vehicle crash on April 3, 2024, in Montgomery County. \n\nAT 7:00 p.m., Deputy Young was assisting deputies in a vehicle pursuit when his vehicle left the roadway and struck a tree at the 4500 block of Hobbie Road. He was transported to Baptist Medical Center South where he succumbed to his critical injuries two days later.\n\nDeputy Young was a United States Army Reserve veteran and had served with the Montgomery County Sheriff's Office for two years. He is survived by his mother, father, three brothers, and two sisters.",
        "age":"21",
        "tour":"2 years",
        "badge":"11718",
        "weapon":null,
        "offender":null,
        "lat":"32.1934367",
        "lon":"-86.2446122"
    },
    {
        "name":"Correctional Sergeant Andrew John Faught",
        "officer_name":"Correctional  Andrew John Faught",
        "title":"Sergeant",
        "department_name":"Illinois Department of Corrections",
        "state_abbreviation":"IL",
        "cause":"Automobile crash",
        "date":"2024-04-08",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26995-correctional-sergeant-andrew-john-faught",
        "photo_url":"26995\/125\/c_andrew-faught.jpg",
        "incident_description":"Correctional Sergeant Drew Faught was killed in a vehicle collision on St. Marie Road in Olney. \n\nAt 7:30 a.m., Sergeant Faught was en route to a tactical call at the Lawrence Correctional Center. As he passed another vehicle in heavy fog, he crashed into another car. \n\nThe driver of the other car sustained minor injuries. \n\nCorrectional Sergeant Faught had served with the Illinois Department of Corrections for six years and was assigned to the Tactical Response Team. He is survived by his parents and eight siblings.",
        "age":"27",
        "tour":"6 years",
        "badge":"9559",
        "weapon":null,
        "offender":null,
        "lat":"38.7912231",
        "lon":"-88.0385639"
    },
    {
        "name":"Chief of Police Steven Allen Singer",
        "officer_name":"Chief of  Steven Allen Singer",
        "title":"Police",
        "department_name":"Lake Lafayette Police Department",
        "state_abbreviation":"MO",
        "cause":"Heart attack",
        "date":"2024-04-08",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26996-chief-of-police-steven-allen-singer",
        "photo_url":"26996\/125\/chief-of-police-steven-allen-singer.jpg",
        "incident_description":"Chief of Police Steven Singer suffered a fatal heart attack after several subjects fled from him near the dam at Lake Lafayette shortly before 6:00 pm.\n\nHe had responded to the dam for reports of people trespassing and driving utility task vehicles (UTV) in the area. As he arrived at the scene, the subjects fled from him on the UTVs and he briefly pursued them. He then searched the area for the subjects before clearing the call. He returned home at the end of his shift, where he suffered a fatal heart attack overnight.\n\nChief Singer had served with the Lake Lafayette Police Department for 20 years. He had also served concurrently in a part-time capacity with the Lafayette County Sheriff's Office for 16 years. He is survived by his fiancée, five children, granddaughter, parents, and siblings.",
        "age":"48",
        "tour":"20 years",
        "badge":"730",
        "weapon":"Person",
        "offender":"Not available",
        "lat":"38.9513679",
        "lon":"-93.9792672"
    },
    {
        "name":"Lieutenant Rodney Osborne",
        "officer_name":"Rodney Osborne",
        "title":"Lieutenant",
        "department_name":"Ohio Department of Rehabilitation and Correction",
        "state_abbreviation":"OH",
        "cause":"Gunfire (Inadvertent)",
        "date":"2024-04-09",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26991-lieutenant-rodney-osborne",
        "photo_url":"26991\/125\/c_osborne_rodney.jpg",
        "incident_description":"Lieutenant Rodney Osborne was shot and killed during a training exercise at the Corrections Training Academy at 1781 State Route 762 in Orient, Ohio.\n\nHe was training at the tactical firing range just before 11:30 a.m. when the incident occurred. \n\nLieutenant Osborne had served with the Ohio Department of Rehabilitation and Correction for 13 years and was assigned to the Southern Ohio Correctional Facility, serving on the honor guard, special response team, and the statewide special tactics and response team. In the week prior to his death, he had received Employee of the Year recognition. He is survived by his wife and three children.",
        "age":"Not available",
        "tour":"13 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"39.7934056",
        "lon":"-83.1509686"
    },
    {
        "name":"Special Agent Derek Sean Baer",
        "officer_name":"Special  Derek Sean Baer",
        "title":"Agent",
        "department_name":"United States Postal Service - Office of Inspector General",
        "state_abbreviation":"US",
        "cause":"Automobile crash",
        "date":"2024-04-09",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26992-special-agent-derek-sean-baer",
        "photo_url":"26992\/125\/c_baer-cigie-photo.jpg",
        "incident_description":"Special Agent Sean Baer was killed in a head-on vehicle crash at the intersection of Route 9 and Oak Lee Drive in Ranson, West Virginia, at about 1:50 pm.\n\nAn oncoming vehicle traveling at a high rate of speed ran a red light, then crossed the median and struck Agent Baer's department vehicle head-on. Agent Baer and the other driver were both killed in the crash.\n\nAgent Baer was a United States Coast Guard veteran. He had served with the United States Postal Service - Office of Inspector General for over nine years and as a federal law enforcement officer with the Department of State for over four years, the Department of Commerce for a year, and the Nuclear Regulatory Commission for over a year. He is survived by his wife and three children.",
        "age":"49",
        "tour":"15 years",
        "badge":"862",
        "weapon":null,
        "offender":null,
        "lat":"39.3197493",
        "lon":"-77.8498279"
    },
    {
        "name":"Police Officer Ross Bartlett",
        "officer_name":"Ross Bartlett",
        "title":"Police",
        "department_name":"Ceresco Police Department",
        "state_abbreviation":"NE",
        "cause":"Automobile crash",
        "date":"2024-04-12",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26997-police-officer-ross-bartlett",
        "photo_url":"26997\/125\/police-officer-ross-bartlett.jpg",
        "incident_description":"Police Officer Ross Bartlett was killed when his patrol car was struck by another vehicle as he conducted a traffic stop on southbound Highway 77 near Little Salt Road at about 7:35 pm.\n\nHe was sitting in his patrol car during the stop when a pickup truck struck his vehicle in the rear, pushing it into the car he had stopped. Bystanders attempted life-saving measures on Officer Bartlett before he was flown to Bryan Health West Campus where he succumbed to his injuries. The driver of the car he had stopped suffered serious injuries as a result of the collision.\n\nOfficer Bartlett had served with the Ceresco Police Department for seven years and had also concurrently served as an investigator with the Nebraska Department of Correctional Services for seven years. He had served a total of 30 years in law enforcement, previously serving with the Valentine Police Department, Boone County Sheriff's Office, Madison Police Department, Madison County Sheriff's Office, and Newman Grove Police Department. He also served as a volunteer firefighter with the Ceresco Fire Department. He is survived by his wife.",
        "age":"54",
        "tour":"30 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"41.0305396",
        "lon":"-96.6402043"
    },
    {
        "name":"Police Officer Joseph Russell McKinney",
        "officer_name":"Joseph Russell McKinney",
        "title":"Police",
        "department_name":"Memphis Police Department",
        "state_abbreviation":"TN",
        "cause":"Gunfire",
        "date":"2024-04-12",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26994-police-officer-joseph-russell-mckinney",
        "photo_url":"26994\/125\/c_mckinney21.jpg",
        "incident_description":"Police Officer Joseph McKinney was shot and killed while investigating a suspicious vehicle at the intersection of Charter Avenue and Horn Lake Road at about 2:00 am.  \n\nHe and other officers were approaching the vehicle when the occupants opened fire on them. Officers returned fire before the car fled. The officers pursued the vehicle and took two wounded subjects into custody after it stopped. The adult subject died of his gunshot wounds and the juvenile subject suffered critical gunshot wounds. The adult subject was out on bond from an arrest the previous month in which he had been charged with possession of a modified semi-automatic weapon and two counts of grand larceny related to vehicle thefts.\n\nOfficer McKinney was transported to Regional One Hospital where he succumbed to his wounds. Two other officers were wounded. \n\nOfficer McKinney had served with the Memphis Police Department for over three years. He is survived by his wife.",
        "age":"26",
        "tour":"3 years",
        "badge":"14649",
        "weapon":"Gun; Unknown type",
        "offender":"1 shot and killed; 1 arrested",
        "lat":"35.0193486",
        "lon":"-90.0682582"
    },
    {
        "name":"Sergeant William Marty Jackson, II",
        "officer_name":"William Marty Jackson,",
        "title":"Sergeant",
        "department_name":"Winchester Police Department",
        "state_abbreviation":"KY",
        "cause":"Heart attack",
        "date":"2024-04-14",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26998-sergeant-william-marty-jackson-ii",
        "photo_url":"26998\/125\/c_marty-jackson78.jpg",
        "incident_description":"Sergeant Marty Jackson suffered a fatal heart attack after arresting a subject for disorderly conduct, public intoxication, and resisting arrest.\n\nAt 3:56 a.m., Sergeant Jackson responded to a call for service at the Clark Regional Medical Center at 175 Hospital Drive in Winchester for a subject who was combative. The subject resisted arrest, and a struggle ensued until additional officers were able to help subdue the subject. Afterward, Sergeant Jackson felt shortness of breath and chest pains. At 7:00 p.m., he suffered a medical emergency while in his police cruiser. Sergeant Jackson was transported to an area hospital where, despite life-saving measures, he was unable to be revived. \n\nSergeant Jackson had served with the Winchester Police Department for almost 47 years and had previously served as the agency's police chief. He had previously served with the Paris Police Department for almost four years. He is survived by his wife, son, daughters, and grandchildren.",
        "age":"73",
        "tour":"51 years",
        "badge":"38",
        "weapon":null,
        "offender":null,
        "lat":"38.0117374",
        "lon":"-84.2164891"
    },
    {
        "name":"Police Officer Michael E. Jensen",
        "officer_name":"Michael E. Jensen",
        "title":"Police",
        "department_name":"Syracuse Police Department",
        "state_abbreviation":"NY",
        "cause":"Gunfire",
        "date":"2024-04-14",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/26999-police-officer-michael-e-jensen",
        "photo_url":"26999\/125\/police-officer-michael-e-jensen.jpg",
        "incident_description":"Police Officer Michael Jensen and Lieutenant Michel Hoosock, of the Onondaga County Sheriff's Office, were shot and killed while attempting to locate a subject who had led officers on a vehicle pursuit earlier in the night.\n\nThe subject had fled from Syracuse police officers when they attempted a traffic stop. As officers terminated the pursuit and then went to the home on Darien Drive, in Salina, where the vehicle was registered. The officers requested assistance from the Onondaga County Sheriff's Office after locating the vehicle at the home and observing firearms inside of it. As they set up a perimeter around the home officers heard the subject manipulating a firearm inside.\n\nLieutenant Hoosock was in the backyard of a neighboring home when the man emerged from the home and opened fire on him with an AR-15, fatally wounding him. The man then went to the front of the home where he exchanged shots with other officers, fatally wounding Officer Jensen. The subject was also shot and killed during the shootout.\n\nOfficer Jensen had served with the Syracuse Police Department for 2-1\/2 years. He is survived by his parents and sister.",
        "age":"29",
        "tour":"2 years, 6 months",
        "badge":"Not available",
        "weapon":"Rifle; AR-15",
        "offender":"Shot and killed",
        "lat":"43.1045506",
        "lon":"-76.1742133"
    },
    {
        "name":"Lieutenant Michael Hoosock",
        "officer_name":"Michael Hoosock",
        "title":"Lieutenant",
        "department_name":"Onondaga County Sheriff's Office",
        "state_abbreviation":"NY",
        "cause":"Gunfire",
        "date":"2024-04-14",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27000-lieutenant-michael-hoosock",
        "photo_url":"27000\/125\/lieutenant-michael-hoosock.jpg",
        "incident_description":"Lieutenant Michel Hoosock and Police Officer Michael Jensen, of the Syracuse Police Department, were shot and killed while attempting to locate a subject who had led officers on a vehicle pursuit earlier in the night.\n\nThe subject had fled from Syracuse police officers when they attempted a traffic stop. As officers terminated the pursuit and then went to the home on Darien Drive, in Salina, where the vehicle was registered. The officers requested assistance from the Onondaga County Sheriff's Office after locating the vehicle at the home and observing firearms inside of it. As they set up a perimeter around the home officers heard the subject manipulating a firearm inside.\n\nLieutenant Hoosock was in the backyard of a neighboring home when the man emerged from the home and opened fire on him with an AR-15, fatally wounding him. The man then went to the front of the home where he exchanged shots with other officers, fatally wounding Officer Jensen. The subject was also shot and killed during the shootout.\n\nLieutenant Hoosock had served with the Onondaga County Sheriff's Office for 16 years. He had previously served with the Moyers Corners Fire Department. He is survived by his wife and three children.",
        "age":"37",
        "tour":"16 years",
        "badge":"Not available",
        "weapon":"Rifle; AR-15",
        "offender":"Shot and killed",
        "lat":"43.1045506",
        "lon":"-76.1742133"
    },
    {
        "name":"Deputy Sheriff Fred Fislar",
        "officer_name":"Fred Fislar",
        "title":"Deputy",
        "department_name":"Hendricks County Sheriff's Office",
        "state_abbreviation":"IN",
        "cause":"Electrocuted",
        "date":"2024-04-16",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27001-deputy-sheriff-fred-fislar",
        "photo_url":"27001\/125\/c_fislar_fred.jpg",
        "incident_description":"Deputy Sheriff Fred Fislar was electrocuted when he came in contact with live wires while investigating a crash scene at State Road 267 and County Road 300 South near Plainfield at 11:57 p.m. on April 15, 2024.\n\nWhile on the scene, witnesses noticed Deputy Fislar on the ground near the power lines and used his radio for help. Deputy Fislar was transported to Eskenazi Hospital in critical condition and did not survive. \n\nDeputy Fislar was a United States Marine Corps veteran and had served with the Hendricks County Sheriff's Office for over 2 1\/2 years. He is survived by his wife and two young children.",
        "age":"28",
        "tour":"2 years, 5 months",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"39.7187080",
        "lon":"-86.3995276"
    },
    {
        "name":"Investigator Brian Herbert",
        "officer_name":"Brian Herbert",
        "title":"Investigator",
        "department_name":"Osage Nation Police Department",
        "state_abbreviation":"TR",
        "cause":"Heart attack",
        "date":"2024-04-17",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27008-investigator-brian-herbert",
        "photo_url":"27008\/125\/c_brian-herbert.jpg",
        "incident_description":"Investigator Brian Herbert suffered a heart attack while qualifying at the shooting range at 8657 Co Road 1701 in Hominy, Oklahoma.  \n\nAfter completing the pistol qualification, he started complaining of heartburn and feeling hot. While resting at 9:41 a.m., he fell over and went in and out of consciousness. Investigator Herbert was unable to be revived despite life-saving measures.\n\nInvestigator Herbert was a United States Army veteran and had served with the Osage Nation Police Department for seven years. During his 28-year law enforcement career, he also served with the Collinsville Police Department (Oklahoma), Logan County Sheriff's Department (Oklahoma), Walters Police Department (Oklahoma), City of Sparta Police Department (Kentucky), Clay City Police Department, where he was an interim Chief of Police, Barnsdall Police Department (Oklahoma), and Oklahoma State University Police Department (Oklahoma). He is survived by his wife, sister, uncle, mother-in-law, and brother-in-law.",
        "age":"56",
        "tour":"28 years",
        "badge":"605",
        "weapon":null,
        "offender":null,
        "lat":"36.3635712",
        "lon":"-96.3675288"
    },
    {
        "name":"Deputy Sheriff Alfredo \"Freddy\" Flores",
        "officer_name":"Alfredo \"Freddy\" Flores",
        "title":"Deputy",
        "department_name":"Los Angeles County Sheriff's Department",
        "state_abbreviation":"CA",
        "cause":"Fire",
        "date":"2024-04-20",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27020-deputy-sheriff-alfredo-freddy-flores",
        "photo_url":"27020\/125\/deputy-sheriff-alfredo-flores.jpg",
        "incident_description":"Deputy Sheriff Freddy Flores succumbed to injuries sustained six months earlier as the result of a fire inside a mobile shooting range at the Pitchess Detention Center in the 29300 block of The Old Road in Castaic.\n\nHe and another deputy were inside the mobile shooting range, built inside a 53-foot semi-trailer when an equipment malfunction ignited a fire at about 9:30 am on October 10th, 2023. They both suffered severe burns before being rescued by fellow deputies and transported to a local hospital.\n\nDeputy Flores succumbed to his injuries on April 20th, 2024.\n\nDeputy Flores had served with the Los Angeles County Sheriff's Department for 20 years. He is survived by his wife, children, parents, and siblings.",
        "age":"Not available",
        "tour":"20 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"34.4640755",
        "lon":"-118.5873678"
    },
    {
        "name":"Police Officer Jordan Wingate",
        "officer_name":"Jordan Wingate",
        "title":"Police",
        "department_name":"Oakland Police Department",
        "state_abbreviation":"CA",
        "cause":"Automobile crash",
        "date":"2024-04-20",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27023-police-officer-jordan-wingate",
        "photo_url":"27023\/125\/police-officer-jordan-wingate.jpg",
        "incident_description":"Police Officer Jordan Wingate succumbed to injuries sustained on August 13th, 2018, while responding to a suspicious person call at the Port of Oakland.\n\nHe was driving in the 1900 block of Middle Harbor Road at about 2:50 am when a vehicle pulled into his path near Berth 55. Officer Wingate's patrol SUV struck the vehicle and then struck a parked tractor-trailer.\n\nRescue personnel extricated him from the vehicle and transported him to a nearby hospital. He medically retired in 2020 and remained under medical care until succumbing to his injuries on April 20th, 2024.\n\nOfficer Wingate had served with the Oakland Police Department for three years and had previously served as a cadet with the department. He was recognized as Rookie of the Year in 2018.",
        "age":"29",
        "tour":"3 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"37.8035803",
        "lon":"-122.3191782"
    },
    {
        "name":"Deputy Sheriff Tobin Bolter",
        "officer_name":"Tobin Bolter",
        "title":"Deputy",
        "department_name":"Ada County Sheriff's Office",
        "state_abbreviation":"ID",
        "cause":"Gunfire",
        "date":"2024-04-21",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27021-deputy-sheriff-tobin-bolter",
        "photo_url":"27021\/125\/deputy-sheriff-tobin-bolter.jpg",
        "incident_description":"Deputy Sheriff Tobin Bolter succumbed to gunshot wounds sustained at about 9:00 pm the previous night while making a traffic stop near the intersection of W Overland Road and S Raymond Street in Boise.\n\nHe had just exited his patrol car and was approaching the vehicle he stopped when the driver opened fire on him before fleeing. A witness to the shooting called 911 and performed CPR on Deputy Bolter before medics arrived and transported him to a local hospital.\n\nThe subject was located near a home on S Jackson Street a short time later. He was shot and killed by Boise police officers after opening fire on them as they attempted to take him into custody. It was later determined that the man was wanted.\n\nDeputy Bolter succumbed to his wounds at about 10:00 am the following morning.\n\nDeputy Bolter had only served with the Ada County Sheriff's Office for four months. He had a total of seven years law enforcement experience and had previously served with the Meridian Police Department and the Pleasant Hill Police Department in California.",
        "age":"27",
        "tour":"7 years",
        "badge":"6466",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"43.5900234",
        "lon":"-116.2636308"
    },
    {
        "name":"Police Officer Luis M. Huesca",
        "officer_name":"Luis M. Huesca",
        "title":"Police",
        "department_name":"Chicago Police Department",
        "state_abbreviation":"IL",
        "cause":"Gunfire",
        "date":"2024-04-21",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27022-police-officer-luis-m-huesca",
        "photo_url":"27022\/125\/c_huesca_luis.jpg",
        "incident_description":"Police Officer Luis Huesca was shot and killed in the 3100 block of West 56th Street at about 2:55 am while driving home following his shift.\n\nOther officers were alerted to the shooting by gunshot detectors in the area and located Officer Huesca suffering from gunshot wounds. He was still in uniform, but his gun and his badge had been stolen along with his personal vehicle. He was transported to the University of Chicago Medical Center where he succumbed to his wounds.\n\nA suspect was arrested on May 1, 2024. \n\nOfficer Huesca had served with the Chicago Police Department for six years and was assigned to the Calumet District's Priority Response Team. He is survived by his mother and uncle.",
        "age":"30",
        "tour":"6 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"41.7917227",
        "lon":"-87.7016589"
    },
    {
        "name":"Investigator John Hampton Coddou, III",
        "officer_name":"John Hampton Coddou,",
        "title":"Investigator",
        "department_name":"Harris County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Struck by vehicle",
        "date":"2024-04-23",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27024-investigator-john-hampton-coddou-iii",
        "photo_url":"27024\/125\/c295_coddou_john.jpg",
        "incident_description":"Investigator John Coddou was struck and killed while helping at the scene of a vehicle crash on the Grand Parkway in Houston.  \n\nAt 9:30 a.m., Investigator Coddou responded to a minor collision near the Cumberland Ridge Drive intersection. He parked on the center median with his lights activated. A truck traveling north swerved to avoid hitting the patrol vehicle and struck Investigator Coddou in the median.\n\nHe was transported by Life Flight to Memorial Hermann Medical Center, where he succumbed to his injuries. \n\nInvestigator Coddou was a United States Army veteran and had served with the Harris County Sheriff's Office for 20 years. He is survived by his wife and mother",
        "age":"50",
        "tour":"20 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"30.0115592",
        "lon":"-95.7689829"
    },
    {
        "name":"Police Officer Kyle Hicks",
        "officer_name":"Kyle Hicks",
        "title":"Police",
        "department_name":"Corpus Christi Police Department",
        "state_abbreviation":"TX",
        "cause":"Gunfire",
        "date":"2024-04-24",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27026-police-officer-kyle-hicks",
        "photo_url":"27026\/125\/police-officer-kyle-hicks.jpg",
        "incident_description":"Police Officer Kyle Hicks succumbed to gunshot wounds sustained four days earlier while responding to a domestic disturbance in the 4900 block of Burnham Drive.\n\nHe and another officer located the apartment at about 12:30 am and could hear a man and woman arguing inside. A male subject came to the door, and a struggle ensued, during which Officer Hicks was shot. The other officer was able to return fire and killed the subject.\n\nOfficer Hicks was transported to a local hospital where he succumbed to his wounds. His organs were donated. \n\nOfficer Hicks had served with the Corpus Christi Police Department for two years. He is survived by his wife and four children.",
        "age":"Not available",
        "tour":"4 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"27.6969609",
        "lon":"-97.3803716"
    },
    {
        "name":"Sergeant Ian Taylor",
        "officer_name":"Ian Taylor",
        "title":"Sergeant",
        "department_name":"Billerica Police Department",
        "state_abbreviation":"MA",
        "cause":"Struck by vehicle",
        "date":"2024-04-26",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27027-sergeant-ian-taylor",
        "photo_url":"27027\/125\/sergeant-ian-taylor.jpg",
        "incident_description":"Sergeant Ian Taylor was struck and killed by a piece of construction equipment while working an overtime assignment at the intersection of Boston Road and Pollard Street at about 2:00 pm.\n\nHe was assisting a tractor-trailer pass through the construction zone when he was struck by an excavator that was backing up. Sergeant Taylor was transported to Lahey Hospital and Medical Center where he succumbed to his injuries.\n\nSergeant Taylor had served with the Billerica Police Department for 13 years and had previously served with the Lawrence Police Department for eight years. He is survived by his wife and three children. His father is a retired Lawrence Police Detective, and his brother is a police detective.",
        "age":"49",
        "tour":"21 years",
        "badge":"159",
        "weapon":null,
        "offender":null,
        "lat":"42.5702875",
        "lon":"-71.2764080"
    },
    {
        "name":"Police Officer Russell Croxton",
        "officer_name":"Russell Croxton",
        "title":"Police",
        "department_name":"Dubach Police Department",
        "state_abbreviation":"LA",
        "cause":"Struck by vehicle",
        "date":"2024-04-27",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27028-police-officer-russell-croxton",
        "photo_url":"27028\/125\/RussellCroxton.jpg",
        "incident_description":"Police Officer Russell Croxton was struck and killed by a tractor-trailer while conducting a traffic stop on US 167 near Robert Lane shortly after 1:00 pm.\n\nThe vehicle he was pulling over stopped in the right travel lane of the four-lane highway. As Officer Croxton spoke with the driver a tractor-trailer failed to move over and struck the back of his patrol truck before striking him and the other vehicle.\n\nOfficer Croxton was transported to a local hospital where he succumbed to his injuries.\n\nOfficer Croxton's father, Sergeant Raymond Croxton, was killed in the line of duty on May 23, 1978, when he was involved in a crash during a vehicle pursuit while serving with the Ruston Police Department.",
        "age":"51",
        "tour":"Not available",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"32.7046315",
        "lon":"-92.6564971"
    },
    {
        "name":"Master-at-Arms Lyndon Joel Cosgriff-Flax",
        "officer_name":"Lyndon Joel Cosgriff-Flax",
        "title":"Master-at-Arms",
        "department_name":"United States Navy Security Forces",
        "state_abbreviation":"US",
        "cause":"Boating accident",
        "date":"2024-04-28",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27041-master-at-arms-lyndon-joel-cosgriff-flax",
        "photo_url":"27041\/125\/master-at-arms-lj-cosgriff-flax.jpg",
        "incident_description":"Master-at-Arms 3rd Class LJ Cosgriff-Flax died when he fell overboard while conducting training at Naval Weapons Station Yorktown in Yorktown, Virginia.\n\nHe was conducting familiarization training on the York River with his harbor security boat team when he fell overboard at about 8:05 pm. MA3 Cosgriff-Flax suffered fatal injuries during the incident.\n\nMA3 Cosgriff-Flax had been stationed at NWS Yorktown for two years. He is survived by his mother, father and stepmother, brother, sister, and grandparents.",
        "age":"22",
        "tour":"2 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"37.2579583",
        "lon":"-76.5282572"
    },
    {
        "name":"Police Officer Joshua Eyer",
        "officer_name":"Joshua Eyer",
        "title":"Police",
        "department_name":"Charlotte-Mecklenburg Police Department",
        "state_abbreviation":"NC",
        "cause":"Gunfire",
        "date":"2024-04-29",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27029-police-officer-joshua-eyer",
        "photo_url":"27029\/125\/c_joshua-eyer.jpg",
        "incident_description":"Police Officer Joshua Eyer succumbed to gunshot wounds he sustained while assisting in serving a warrant on a convicted felon in the 5500 block of Galway Drive in east Charlotte. \n\nAt 1:30 p.m., members of the U.S. Marshals Carolinas Regional Fugitive Task Force attempted to serve a felony warrant for possession of a firearm by a convicted felon. The wanted subject ambushed them with a high-powered rifle and engaged them in a prolonged gun battle.\n\nInvestigator Sam Poloche, Investigator Alden Elliott, and Deputy U.S. Marshal Thomas Weeks were killed at the scene. Officer Eyer succumbed to his wounds several hours later. Three officers from the Charlotte-Mecklenburg Police Department and a second Deputy United States Marshal were also wounded. \n\nThe wanted subject was shot and killed, and two subjects were taken into custody for questioning. \n\nInvestigator Eyer was a North Carolina Army National Guard veteran and had served with the Charlotte-Mecklenburg Police Department for six years. He was the Officer of the Month for April 2024. He is survived by his wife and three-year-old son.",
        "age":"31",
        "tour":"6 years",
        "badge":"5836",
        "weapon":"Rifle",
        "offender":"Shot and killed",
        "lat":"35.2440632",
        "lon":"-80.7552458"
    },
    {
        "name":"Investigator Samuel Poloche",
        "officer_name":"Samuel Poloche",
        "title":"Investigator",
        "department_name":"North Carolina Department of Adult Correction",
        "state_abbreviation":"NC",
        "cause":"Gunfire",
        "date":"2024-04-29",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27030-investigator-samuel-poloche",
        "photo_url":"27030\/125\/c_soiu-samuel-poloche.jpg",
        "incident_description":"Investigator Sam Poloche and Investigator Alden Elliott of the North Carolina Department of Adult Correction, Police Officer Joshua Eyer of the Charlotte-Mecklenburg Police Department, and Deputy U.S. Marshal Thomas Weeks were shot and killed while attempting to serve a warrant in the 5500 block of Galway Drive in east Charlotte. \n\nAt 1:30 p.m., members of the U.S. Marshals Carolinas Regional Fugitive Task Force attempted to serve a felony warrant for possession of a firearm by a convicted felon. The wanted subject ambushed them with a high-powered rifle and engaged them in a prolonged gun battle.\n\nInvestigator Poloche, Investigator Elliott, and Deputy U.S. Marshal Thomas Weeks were killed at the scene. Officer Joshua Eyer succumbed to his wounds several hours later. Three officers from the Charlotte-Mecklenburg Police Department and a second Deputy United States Marshal were also wounded. \n\nThe wanted subject was shot and killed, and two subjects were taken into custody for questioning. \n\nInvestigator Poloche had served with the North Carolina Department of Adult Correction for 14 years and was assigned to the Special Operations and Intelligence Unit. He is survived by his wife and two children.",
        "age":"42",
        "tour":"14 years",
        "badge":"Not available",
        "weapon":"Rifle",
        "offender":"Shot and killed",
        "lat":"35.2440632",
        "lon":"-80.7552458"
    },
    {
        "name":"Investigator William \"Alden\" Elliott",
        "officer_name":"William \"Alden\" Elliott",
        "title":"Investigator",
        "department_name":"North Carolina Department of Adult Correction",
        "state_abbreviation":"NC",
        "cause":"Gunfire",
        "date":"2024-04-29",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27031-investigator-william-alden-elliott",
        "photo_url":"27031\/125\/c_soiu-william-elliott.jpg",
        "incident_description":"Investigator Alden Elliott and Investigator Sam Poloche of the North Carolina Department of Adult Correction, Police Officer Joshua Eyer of the Charlotte-Mecklenburg Police Department, and Deputy U.S. Marshal Thomas Weeks were shot and killed while attempting to serve a warrant in the 5500 block of Galway Drive in east Charlotte. \n\nAt 1:30 p.m., members of the U.S. Marshals Carolinas Regional Fugitive Task Force attempted to serve a felony warrant for possession of a firearm by a convicted felon. The wanted subject ambushed them with a high-powered rifle and engaged them in a prolonged gun battle.\n\nInvestigator Poloche, Investigator Elliott, and Deputy United States Marshal Thomas Weeks were killed at the scene. Officer Joshua Eyer succumbed to his wounds several hours later. Three officers from the Charlotte-Mecklenburg Police Department and a second Deputy United States Marshal were also wounded. \n\nThe wanted subject was shot and killed, and two subjects were taken into custody for questioning. \n\nInvestigator Elliott was a United States Marine Corps veteran. He had served with the North Carolina Department of Adult Correction for 14 years, was assigned to the Special Operations and Intelligence Unit and the U.S. Marshal's Regional Fugitive Task Force, and previously served with the Overland Park Police Department (Kansas). He is survived by his wife and son.",
        "age":"46",
        "tour":"16 years",
        "badge":"Not available",
        "weapon":"Rifle",
        "offender":"Shot and killed",
        "lat":"35.2440632",
        "lon":"-80.7552458"
    },
    {
        "name":"Deputy U.S. Marshal Thomas M. Weeks",
        "officer_name":"U.S.  Thomas M. Weeks",
        "title":"Deputy",
        "department_name":"United States Department of Justice - United States Marshals Service",
        "state_abbreviation":"US",
        "cause":"Gunfire",
        "date":"2024-04-29",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27032-deputy-us-marshal-thomas-m-weeks",
        "photo_url":"27032\/125\/c_weeks_thomas.jpg",
        "incident_description":"Deputy U.S. Marshal Thomas Weeks, Investigator Alden Elliott and Investigator Sam Poloche of the North Carolina Department of Adult Correction, and Police Officer Joshua Eyer of the Charlotte-Mecklenburg Police Department were shot and killed while attempting to serve a warrant in the 5500 block of Galway Drive in east Charlotte.\n\nAt 1:30 p.m., members of the U.S. Marshals Carolinas Regional Fugitive Task Force attempted to serve a felony warrant for possession of a firearm by a convicted felon. The wanted subject ambushed them with a high-powered rifle and engaged them in a prolonged gun battle.\n\nDeputy U.S. Marshal Weeks, Investigator Poloche, and Investigator Elliott were killed at the scene. Officer Joshua Eyer succumbed to his wounds several hours later. Three officers from the Charlotte-Mecklenburg Police Department and a second Deputy United States Marshal were also wounded.\n\nThe wanted subject was shot and killed, and two subjects were taken into custody for questioning.\n\nDeputy U.S. Marshal Weeks had served with the United States Department of Justice - United States Marshals Service for 13 years and previously served with the United States Department of Homeland Security - Customs and Border Protection for eight years. He is survived by his wife and four children.",
        "age":"48",
        "tour":"21 years",
        "badge":"Not available",
        "weapon":"Rifle",
        "offender":"Shot and killed",
        "lat":"35.2440632",
        "lon":"-80.7552458"
    },
    {
        "name":"Assistant Chief Kevin Linn Palmer",
        "officer_name":"Chief Kevin Linn Palmer",
        "title":"Assistant",
        "department_name":"North Richland Hills Police Department",
        "state_abbreviation":"TX",
        "cause":"Heart attack",
        "date":"2024-05-01",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27091-assistant-chief-kevin-linn-palmer",
        "photo_url":"27091\/125\/c_k._palmer.jpg",
        "incident_description":"Assistant Chief Kevin Palmer suffered a fatal heart attack after completing a mandatory physical fitness test at 4301 City Point Drive in North Richland Hills on April 30, 2024. \n\nAfter collapsing, resuscitation efforts were immediately administered. He was transferred to Medical City North Hills Hospital where he was unable to be revived. He remained on life support until his organs could be donated.  \n\nAssistant Chief Palmer was a United States Air Force veteran and served with the North Richland Hills Police Department for 20 years. He is survived by his wife and two sons.",
        "age":"44",
        "tour":"20 years",
        "badge":"618",
        "weapon":null,
        "offender":null,
        "lat":"32.8272526",
        "lon":"-97.2175919"
    },
    {
        "name":"Trooper II Marcellus E. Bethea",
        "officer_name":"Marcellus E. Bethea",
        "title":"Trooper",
        "department_name":"New Jersey State Police",
        "state_abbreviation":"NJ",
        "cause":"Duty related illness",
        "date":"2024-05-05",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27045-trooper-ii-marcellus-e-bethea",
        "photo_url":"27045\/125\/c_bethea_marcellus.jpg",
        "incident_description":"Trooper II Marcellus Bethea collapsed and died while training at the Ewing Headquarters Division at 1040 River Road in Ewing Township. \n\nTrooper Bethea was training to join Teams Unit One, the New Jersey State Police SWAT Team. \n\nTrooper Bethea had served with the New Jersey State Police for eight years. He is survived by his wife and daughter.",
        "age":"33",
        "tour":"8 years",
        "badge":"7829",
        "weapon":null,
        "offender":null,
        "lat":"40.2633216",
        "lon":"-74.8392150"
    },
    {
        "name":"Sergeant Bill Hooser",
        "officer_name":"Bill Hooser",
        "title":"Sergeant",
        "department_name":"Santaquin Police Department",
        "state_abbreviation":"UT",
        "cause":"Vehicular assault",
        "date":"2024-05-05",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27039-sergeant-bill-hooser",
        "photo_url":"27039\/125\/c_bill-hooser.jpg",
        "incident_description":"Sergeant Bill Hooser was struck and killed by a tractor-trailer that was fleeing a traffic stop on I-15 near mile marker 244 in Santaquin. \n\nA Utah Highway Patrol trooper and Sergeant Hooser initiated a traffic stop at 6:30 a.m. after reports of a person standing on the back of a semi-trailer. The driver fled and turned his tractor-trailer around, driving south on the northbound lanes, when he hit Sergeant Hooser, his patrol car, and the trooper's vehicle. Sergeant Hooser was killed instantly.\n\nThe subject fled on foot and stole a truck. He was apprehended after crashing the truck during a short pursuit. \n\nSergeant Hooser had served with the Santaquin Police Department for seven years and previously served with the San Juan County Sheriff's Office (New Mexico) for two years. He is survived by his wife, two daughters, and a granddaughter.",
        "age":"50",
        "tour":"9 years",
        "badge":"14J4",
        "weapon":"Automobile; Commercial",
        "offender":"In custody",
        "lat":"39.9723299",
        "lon":"-111.7759180"
    },
    {
        "name":"Police Officer Jacob Derbin",
        "officer_name":"Jacob Derbin",
        "title":"Police",
        "department_name":"Euclid Police Department",
        "state_abbreviation":"OH",
        "cause":"Gunfire",
        "date":"2024-05-11",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27042-police-officer-jacob-derbin",
        "photo_url":"27042\/125\/police-officer-jacob-derbin.jpg",
        "incident_description":"Police Officer Jacob Derbin was shot and killed while responding to a disturbance call in the 300 block of East 211th Street at about 9:55 pm.\n\nHe was ambushed by a subject after he arrived at the location. The man who shot him, who is a convicted felon and was wanted for violating conditions of his community supervision, fled the scene. \n\nOfficer Derbin was transported to University Hospital where he succumbed to his wounds. \n\nThe suspect was found dead from a self-inflicted gunshot wound the next day. \n\nOfficer Derbin was a United States Army National Guard veteran and had served with the Euclid Police Department for 10 months. He is survived by his mother, father, three brothers, a sister, and fiancée.",
        "age":"23",
        "tour":"10 months",
        "badge":"14",
        "weapon":"Gun; Unknown type",
        "offender":"Committed suicide",
        "lat":"41.6017146",
        "lon":"-81.5327242"
    },
    {
        "name":"Corporal Pricilla Soell Pierson",
        "officer_name":"Pricilla Soell Pierson",
        "title":"Corporal",
        "department_name":"Ponchatoula Police Department",
        "state_abbreviation":"LA",
        "cause":"Heart attack",
        "date":"2024-05-28",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27068-corporal-pricilla-soell-pierson",
        "photo_url":"27068\/125\/c_pricilla-pierson.jpg",
        "incident_description":"Corporal Pricilla Pierson suffered a fatal heart attack after responding to a shooting call in a Ponchatoula residential neighborhood around 5:00 a.m. \n\nAfter the call, she was found in her patrol car unresponsive in the parking lot of a local supermarket and was unable to be revived.\n\nCorporal Pierson had served with the Ponchatoula Police Department for six years. She was survived by her husband, three children, two step-children, mother, step-father, two brothers, and a grandchild.",
        "age":"44",
        "tour":"6 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"30.4373926",
        "lon":"-90.4543677"
    },
    {
        "name":"Trooper First Class Aaron Pelletier",
        "officer_name":"Aaron Pelletier",
        "title":"Trooper",
        "department_name":"Connecticut State Police",
        "state_abbreviation":"CT",
        "cause":"Vehicular assault",
        "date":"2024-05-30",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27057-trooper-first-class-aaron-pelletier",
        "photo_url":"27057\/125\/c493_pelletier.jpg",
        "incident_description":"Trooper First Class Aaron Pelletier was struck and killed by a truck while conducting a traffic stop on I-84 East near Exit 31 in Southington.\n\nAt 2:45 p.m., Trooper Pelletier pulled over a vehicle on the right shoulder of the highway with his emergency equipment activated on his cruiser. While he was speaking with the driver of the car, a truck crossed the dividing line into the shoulder lane, sideswiped his cruiser, and struck him. The driver fled in the vehicle and was apprehended approximately five miles away in a wooded area.\n\nTrooper Pelletier was killed instantly. His canine partner, Roso, was in the cruiser when it was struck, but he was not injured. \n\nThe subject was arrested and charged with evading responsibility for a crash causing death, illegal operation of a motor vehicle under the influence of alcohol\/drugs, failure to drive in the proper lane, second-degree manslaughter with a motor vehicle, failure to move over, and illegal operation of a motor vehicle without a driver's license.  \n\nTrooper Pelletier had served with the Connecticut State Police for nine years and was assigned to Troop H in Hartford. He is survived by his wife and two children.",
        "age":"34",
        "tour":"9 years",
        "badge":"536",
        "weapon":"Automobile",
        "offender":"In custody",
        "lat":"41.6066858",
        "lon":"-72.9011943"
    },
    {
        "name":"Police Officer Jamal Mitchell",
        "officer_name":"Jamal Mitchell",
        "title":"Police",
        "department_name":"Minneapolis Police Department",
        "state_abbreviation":"MN",
        "cause":"Gunfire",
        "date":"2024-05-30",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27055-police-officer-jamal-mitchell",
        "photo_url":"27055\/125\/policeofficer_jamalmitchell.jpg",
        "incident_description":"Police Officer Jamal Mitchell was shot and killed after being ambushed while responding to a shooting call.\n\nJust after 5:00 p.m., officers responded to a shots fired call at an apartment on 22nd Street near Blaisdell Avenue in Minneapolis. When officers arrived, the suspect fired at officers, and a gunfight ensued.\n\nOfficer Mitchell stopped to render aid to who he thought was a wounded victim when that man shot him multiple times. Two officers arriving on the scene witnessed the suspect shooting Officer Mitchell. The suspect turned and started shooting at them. They returned fire, killing the suspect. \n\nTwo shooting victims were found at the scene. One was pronounced dead, and the other died 11 days later. Another officer and firefighter were wounded with non-life-threatening injuries. An innocent bystander was also shot. \n\nOfficer Mitchell was transported to Hennepin Healthcare where he succumbed to his wounds. \n\nOfficer Mitchell had served with the Minneapolis Police Department for two years. He is survived by his son and fiancée.\n\nOn Officer Mitchell's third day working for the Minneapolis Police Department, he rescued an elderly couple from a burning home. In 2024, he was posthumously awarded the Minnesota Medal of Honor and a Purple Heart.",
        "age":"36",
        "tour":"2 years",
        "badge":"4819",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"44.9613324",
        "lon":"-93.2795522"
    },
    {
        "name":"Agent Davis Geovanni Martinez",
        "officer_name":"Davis Geovanni Martinez",
        "title":"Agent",
        "department_name":"Maryland Department of Public Safety and Correctional Services - Division of Parole and Probation",
        "state_abbreviation":"MD",
        "cause":"Stabbed",
        "date":"2024-05-31",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27061-agent-davis-geovanni-martinez",
        "photo_url":"27061\/125\/c_davis-geovanni-martinez.jpg",
        "incident_description":"Agent Davis Martinez was stabbed while conducting a home visit on a convicted sex offender in the 2800 block of Terrace Drive in Chevy Chase.\n\nOfficers from the Montgomery County Police Department went to check on Agent Martinez after he failed to return to his office. The officers discovered his body at the offender's apartment, suffering from multiple stab wounds. \n\nThe subject had fled the scene but was arrested in Hurricane, West Virginia, the following day by members of a United States Marshals Service task force. He has been charged with second-degree murder.\n\nAgent Martinez had served with the Maryland Division of Parole and Probation for six years and was assigned to the Silver Spring Field Office.",
        "age":"33",
        "tour":"6 years",
        "badge":"2422",
        "weapon":"Edged weapon",
        "offender":"Charged with murder",
        "lat":"38.9969907",
        "lon":"-77.0586703"
    },
    {
        "name":"Police Officer Joshua Briese",
        "officer_name":"Joshua Briese",
        "title":"Police",
        "department_name":"Gila River Police Department",
        "state_abbreviation":"TR",
        "cause":"Gunfire",
        "date":"2024-06-01",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27058-police-officer-joshua-briese",
        "photo_url":"27058\/125\/c_briese.jpg",
        "incident_description":"Police Officer Joshua Briese was shot and killed while responding to a disturbance call at 2:00 a.m. at a home in Santan, District 4 of the Gila River Indian Community.\n\nWhen Officer Briese and his training partner arrived on the scene, they were met with gunfire. Both officers were transported to a local hospital where Officer Briese succumbed to his wounds. The other officer is in stable but serious condition. \n\nFour other people from the large crowd were struck by gunfire, including one who died.\n\nA man and a juvenile were arrested. \n\nOfficer Briese's father, Deputy Sheriff David Leroy Briese, Jr. of Yellowstone County Sheriff's Office, Montana, died in the line of duty on November 3, 2006.\n\nOfficer Briese had served with the Gila River Police Department for less than one year and was still completing field training.",
        "age":"24",
        "tour":"Not available",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"33.1320310",
        "lon":"-111.7644427"
    },
    {
        "name":"Senior Police Officer Vicente Ortiz, Jr.",
        "officer_name":"Senior   Vicente Ortiz, Jr.",
        "title":"Police",
        "department_name":"Corpus Christi Police Department",
        "state_abbreviation":"TX",
        "cause":"Motorcycle crash",
        "date":"2024-06-01",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27059-senior-police-officer-vicente-ortiz-jr",
        "photo_url":"27059\/125\/senior-police-officer-vicente-ortiz.jpg",
        "incident_description":"Senior Police Officer Vicente Ortiz succumbed to injuries sustained 10 days earlier when he was involved in a motorcycle crash while escorting a funeral procession.\n\nHe was traveling southbound on Kostoryz Road when another driver attempted to cross the road at the intersection with Sacky Drive. Officer Ortiz was unable to stop and struck the other vehicle. He was transported to a local hospital where he underwent multiple surgeries before succumbing to his injuries.\n\nOfficer Ortiz had served with the Corpus Christi Police Department for 15 years. He is survived by his wife and two children.",
        "age":"Not available",
        "tour":"15 years",
        "badge":"746",
        "weapon":null,
        "offender":null,
        "lat":"27.7255692",
        "lon":"-97.4148712"
    },
    {
        "name":"Constable Philip John Michael",
        "officer_name":"Philip John Michael",
        "title":"Constable",
        "department_name":"Pennsylvania State Constable - Fayette County",
        "state_abbreviation":"PA",
        "cause":"Automobile crash",
        "date":"2024-06-06",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27070-constable-philip-john-michael",
        "photo_url":"27070\/125\/c_philip-michael-2024.jpg",
        "incident_description":"Constable Philip Michael succumbed to injuries he received in a vehicle crash on May 3, 2024, while en route to serve a warrant.\n\nAround 2:00 p.m., Constable Michael was traveling on Route 51 in Perryopolis when a driver ran a red light at Independence Street and struck his vehicle. He was transported to Allegheny General Hospital where he passed away on June 6, 2024. \n\nThe driver pleaded guilty to failure to stop at a red signal, not yielding on the roadway, and careless driving causing intentional death. \n\nConstable Michael had served with the Pennsylvania State Constable - Fayette County for 16 years. He is survived by his wife, two sons, parents, and two brothers.",
        "age":"51",
        "tour":"16 years",
        "badge":"23",
        "weapon":null,
        "offender":null,
        "lat":"40.0863325",
        "lon":"-79.7606753"
    },
    {
        "name":"Sergeant Floyd H. Miles, Jr.",
        "officer_name":"Floyd H. Miles, Jr.",
        "title":"Sergeant",
        "department_name":"Charles City County Sheriff's Office",
        "state_abbreviation":"VA",
        "cause":"Heart attack",
        "date":"2024-06-09",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27063-sergeant-floyd-h-miles-jr",
        "photo_url":"27063\/125\/sergeant-floyd-miles.jpg",
        "incident_description":"Sergeant Floyd Miles suffered a fatal heart attack while struggling with a subject inside an ambulance at the intersection of John Tyler Memorial Highway and Wayside Road.\n\nAt 12:30 p.m., a deputy was monitoring traffic at the intersection when a subject on a moped fell onto the deputy's vehicle. The man claimed people were trying to kill him. After noticing there was blood on him, the deputy requested an ambulance. Medics were tending to the subject inside the ambulance when the man suddenly attacked the deputy once he returned to the rear of the ambulance. Sergeant Miles arrived on the scene to assist the deputy, and he was also attacked. During the ensuing struggle, Sergeant Miles suffered a medical emergency and collapsed.\n\nHe was transported to MCV\/New Kent Medical Center where he passed away.\n\nThe subject was transported to the hospital. \n\nSergeant Miles was a U.S. Army veteran and had served with the Charles City County Sheriff's Office for 16 years. He is survived by his wife, three stepsons, mother, father, brothers, a sister, and a grandson.",
        "age":"45",
        "tour":"16 years",
        "badge":"5",
        "weapon":"Person",
        "offender":"Apprehended",
        "lat":"37.3761705",
        "lon":"-77.2243906"
    },
    {
        "name":"Detective Ryan So",
        "officer_name":"Ryan So",
        "title":"Detective",
        "department_name":"Scottsdale Police Department",
        "state_abbreviation":"AZ",
        "cause":"Gunfire (Inadvertent)",
        "date":"2024-06-13",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27065-detective-ryan-so",
        "photo_url":"27065\/125\/c_ryan_so.jpg",
        "incident_description":"Detective Ryan So was accidentally shot and killed after serving a search warrant and conducting an arrest on 78th Street near N Greenway Hayden Loop in Scottsdale. \n\nAt 7:30 p.m., while unloading equipment from a vehicle, a rifle fell out of the bag, hit the ground, and discharged, striking Detective So. Despite fellow officers rendering aid, he succumbed to his wounds at the hospital. \n\nDetective So was a United States Navy veteran and had served with the Scottsdale Police Department for nine years. He is survived by his wife and three daughters.",
        "age":"38",
        "tour":"9 years",
        "badge":"1473",
        "weapon":null,
        "offender":null,
        "lat":"33.6296209",
        "lon":"-111.9130789"
    },
    {
        "name":"Deputy Sheriff Bradley J. Reckling",
        "officer_name":"Bradley J. Reckling",
        "title":"Deputy",
        "department_name":"Oakland County Sheriff's Office",
        "state_abbreviation":"MI",
        "cause":"Gunfire",
        "date":"2024-06-22",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27069-deputy-sheriff-bradley-j-reckling",
        "photo_url":"27069\/125\/detective-bradley-reckling.jpg",
        "incident_description":"Deputy Sheriff Bradley Reckling was shot and killed while conducting surveillance on a stolen vehicle in Detroit at about 10:00 pm.\n\nHe and other detectives with the Auto Theft Unit were searching for a car stolen from the Red Oaks Water Park earlier in the day. Detective Reckling located the vehicle with three occupants and started following it as he coordinated with the other detectives. While he continued surveillance of the vehicle the driver suddenly stopped, and the occupants opened fire on Deputy Reckling's vehicle.\n\nDeputy Reckling was transported to a local hospital where he succumbed to his injuries.\n\nThe three occupants of the vehicle fled but were apprehended a short time later.\n\nDeputy Reckling had served with the Oakland County Sheriff's Office for nine years and was assigned to the Auto Theft Unit. He had received numerous awards during his career. He is survived by his expectant wife and three children.",
        "age":"30",
        "tour":"9 years",
        "badge":"1972",
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"42.4297796",
        "lon":"-82.9811813"
    },
    {
        "name":"Agent Luis Algarin De Jesús",
        "officer_name":"Luis Algarin De Jesús",
        "title":"Agent",
        "department_name":"Puerto Rico Police Department",
        "state_abbreviation":"PR",
        "cause":"Motorcycle crash",
        "date":"2024-06-24",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27071-agent-luis-algarin-de-jess",
        "photo_url":"27071\/125\/c_algarin-de-jesus.jpg",
        "incident_description":"Agent Luis Algarin De Jesús was killed when his motorcycle was struck on Highway PR-1 in Santa Isabel, Puerto Rico.\n\nAround 6:00 am, Agent Algarin De Jesús was traveling on the two-lane highway of Highway PR-1 in the Jauca neighborhood when the driver of a vehicle crossed the center line, attempting to pass another vehicle. The SUV hit Agent Algarin De Jesús' motorcycle head-on, killing him instantly.\n\nAgent Luis Algarin De Jesús had served with the Puerto Rico Police Department for 30 years and was assigned to the Santa Isabel District.",
        "age":"51",
        "tour":"30 years",
        "badge":"21039",
        "weapon":null,
        "offender":null,
        "lat":"17.9708698",
        "lon":"-66.3614223"
    },
    {
        "name":"Youth Counselor Corey Proulx",
        "officer_name":"Youth  Corey Proulx",
        "title":"Counselor",
        "department_name":"Wisconsin Department of Corrections",
        "state_abbreviation":"WI",
        "cause":"Assault",
        "date":"2024-06-25",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27083-youth-counselor-corey-proulx",
        "photo_url":"27083\/125\/c_corey-proulx.jpg",
        "incident_description":"Youth Counselor Corey Proulx succumbed to injuries he received when he was assaulted by a juvenile inmate at the Lincoln Hills School at W4380 Copper Lake Avenue in Irma. \n\nShortly before 8:00 p.m. on June 24, 2024, a juvenile threw a cup of hair conditioner into the face of a female staff member. He repeatedly punched her in the torso and face before fleeing from the Krueger Living Facility. Counselor Proulx followed the juvenile outside to detain him when the teenager struck him multiple times in the head and face. He fell to the ground, hitting his head on the concrete, and was unresponsive. \n\nCounselor Proulx was airlifted to Aspirus Wausau Hospital where he was declared brain dead on June 25, 2024. He remained on life support until his organs could be donated. The female counselor was treated at the hospital and released. \n\nThe juvenile is charged with second-degree reckless homicide, felony murder, and two counts of battery by prisoners. Another juvenile, who procured the hair conditioner for the suspect, has been charged with being a party to the crimes of felony murder with special circumstances and two counts of battery by a prisoner. \n\nCounselor Proulx is survived by his daughter and fiancee.",
        "age":"49",
        "tour":"Not available",
        "badge":"Not available",
        "weapon":"Person",
        "offender":"Charged with murder",
        "lat":"45.3273538",
        "lon":"-89.6432770"
    },
    {
        "name":"Deputy Sheriff William Butler, Jr.",
        "officer_name":"William Butler, Jr.",
        "title":"Deputy",
        "department_name":"Hillsdale County Sheriff's Office",
        "state_abbreviation":"MI",
        "cause":"Gunfire",
        "date":"2024-06-27",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27084-deputy-sheriff-william-butler-jr",
        "photo_url":"27084\/125\/c_butler-bill.jpg",
        "incident_description":"Deputy Sheriff Bill Butler was shot and killed while assisting another deputy with a traffic stop near the intersection of Beecher and Lamb Road in Jefferson Township around 2:30 p.m.\n\nThe driver had warrants out for his arrest and did not cooperate with the deputies. During the struggle, the subject pulled out a gun, striking Deputy Butler before fleeing on foot. \n\nDeputy Butler was transported to the hospital where he succumbed to his wounds. \n\nThe subject was found about two miles away several hours later. When he fired on troopers, they returned fire, killing the subject. \n\nDeputy Butler was an Operation Iraqi Freedom veteran and had served with the Hillsdale County Sheriff's Office for 12 years. He is survived by his wife and five children.",
        "age":"51",
        "tour":"12 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"41.8833209",
        "lon":"-84.5053142"
    },
    {
        "name":"Police Officer Jamieson Ritter",
        "officer_name":"Jamieson Ritter",
        "title":"Police",
        "department_name":"Cleveland Division of Police",
        "state_abbreviation":"OH",
        "cause":"Gunfire",
        "date":"2024-07-04",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27085-police-officer-jamieson-ritter",
        "photo_url":"27085\/125\/police-officer-jamieson-ritter.jpg",
        "incident_description":"Police Officer Jamieson Ritter was shot and killed at about 1:00 am while attempting to arrest a wanted subject in the 1500 block of East 80th Street.\n\nOfficers had responded to a house on the street after receiving information that a subject wanted for felonious assault was inside. The man exited the home and attempted to flee on a bike before opening fire on officers. Officer Ritter was shot and killed by the subject.\n\nThe man was taken into custody and charged with aggravated murder.\n\nOfficer Ritter was a member of the Ohio Army National Guard. He had served with the Cleveland Division of Police for four years and was assigned to the Third District. He had recently been recognized as Officer of the Month.",
        "age":"27",
        "tour":"4 years",
        "badge":"1176",
        "weapon":"Gun; Unknown type",
        "offender":"Charged with murder",
        "lat":"41.5154420",
        "lon":"-81.6332079"
    },
    {
        "name":"Probationary Police Officer Edgar Ordonez",
        "officer_name":"Probationary   Edgar Ordonez",
        "title":"Police",
        "department_name":"New York City Police Department",
        "state_abbreviation":"NY",
        "cause":"Heatstroke",
        "date":"2024-07-10",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27100-probationary-police-officer-edgar-ordonez",
        "photo_url":"27100\/125\/c_edgar-ordonez.jpg",
        "incident_description":"Probationary Police Officer Edgar Ordonez died after suffering from heatstroke at the NYPD outdoor shooting range at Rodman's Neck in the Bronx.\n\nHe and other probationary police officers were training at the range during a heat advisory when he collapsed. He was transported to a local hospital where he passed away a short time later.\n\nOfficer Ordonez had served with the New York City Police Department for six months and was scheduled to graduate from the academy the following week.",
        "age":"33",
        "tour":"6 months",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"40.8529244",
        "lon":"-73.8003442"
    },
    {
        "name":"Police Officer Matthew Bowen",
        "officer_name":"Matthew Bowen",
        "title":"Police",
        "department_name":"Vacaville Police Department",
        "state_abbreviation":"CA",
        "cause":"Vehicular assault",
        "date":"2024-07-11",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27095-police-officer-matthew-bowen",
        "photo_url":"27095\/125\/police-officer-matthew-bowen.jpg",
        "incident_description":"Police Officer Matthew Bowen died from injuries received from being struck by a vehicle while initiating a traffic stop.\n\nHe initiated a traffic stop at the intersection of Leisure Town Road and Orange Drive at about 11:00 am.  While stopped along northbound Leisure Town Road, both Officer Bowen and the stopped driver were struck from behind by a driver believed to be under the influence of drugs. Officer Bowen was thrown from his motorcycle by the force of the collision.\n\nOfficer Bowen was transported to Kaiser Vacaville Medical Center where he succumbed to his injuries at approximately 3:00 PM.   \n\nThe driver of the vehicle that caused the crash attempted to flee the scene immediately after hitting Officer Bowen but was stopped by community members and detained until additional police arrived. She was arrested at the scene.\n\nOfficer Bowen had served with the Vacaville Police Department for just over one year and had previously served with the Concord Police Department for 3-1\/2 years.  He is survived by his wife, two children, his parents, and one brother.",
        "age":"32",
        "tour":"1 year",
        "badge":"854",
        "weapon":"Automobile",
        "offender":"Apprehended",
        "lat":"38.3845300",
        "lon":"-121.9336800"
    },
    {
        "name":"Deputy Sheriff Fernando Esqueda",
        "officer_name":"Fernando Esqueda",
        "title":"Deputy",
        "department_name":"Harris County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Gunfire",
        "date":"2024-07-11",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27094-deputy-sheriff-fernando-esqueda",
        "photo_url":"27094\/125\/detective-fernando-esqueda.jfif",
        "incident_description":"Deputy Sheriff Fernando Esqueda was shot and killed from ambush after locating a vehicle wanted in connection to an aggravated assault.\n\nThe subject had become engaged in an argument with a restaurant employee over an incorrect order and pistol-whipped the worker. Witnesses provided responding deputies with the suspect's license plate number, which detectives used to locate an area of interest using a license plate reader system. Detectives conducted an initial search of the area but didn't locate the vehicle and cleared the area.\n\nA short time later Deputy Esqueda returned to the area and located the vehicle unoccupied in the 13200 block of Italian Cypress Trail. As he coordinated with other deputies, the subject ambushed him and shot him multiple times. The responding deputies transported Deputy Esqueda to a local hospital where he succumbed to his wounds.\n\nThe subject was arrested the following day and charged with capital murder. Another subject was charged with capital murder and tampering with evidence. \n\nDeputy Esqueda had served with the Harris County Sheriff's Office for five years. He was assigned to the Violent Person Task Force and was working mandatory patrols in the aftermath of Hurricane Beryl. He is survived by his mother, father, three sisters, three brothers, and a fiancée.",
        "age":"28",
        "tour":"5 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Charged with capital murder",
        "lat":"29.8695228",
        "lon":"-95.1975154"
    },
    {
        "name":"Corporal Robert William Sumner",
        "officer_name":"Robert William Sumner",
        "title":"Corporal",
        "department_name":"Oklahoma Department of Corrections",
        "state_abbreviation":"OK",
        "cause":"Automobile crash",
        "date":"2024-07-14",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27096-corporal-robert-william-sumner",
        "photo_url":"27096\/125\/c_robert-sumner.png",
        "incident_description":"Corporal Robby Sumner was killed in a vehicle crash on Highway 62, one mile east of Meeker. \n\nAt 5:22 a.m., Corporal Sumner was driving an Oklahoma Department of Corrections van en route to the OU Medical Center when he and another vehicle collided. He was pronounced deceased at the scene. The driver of the other vehicle, also a corrections officer, was transported to OU Medical Center and is in stable condition. \n\nCorporal Sumner had served with the Oklahoma Department of Corrections for eight months and was assigned to the John Lilley Correctional Center in Boley. He is survived by his expectant wife, son, father, mother, and six siblings.",
        "age":"31",
        "tour":"10 months",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"35.5029659",
        "lon":"-96.8727645"
    },
    {
        "name":"Corporal Mohamed Said",
        "officer_name":"Mohamed Said",
        "title":"Corporal",
        "department_name":"Melvindale Police Department",
        "state_abbreviation":"MI",
        "cause":"Gunfire",
        "date":"2024-07-21",
        "year":2024,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27101-corporal-mohamed-said",
        "photo_url":"27101\/125\/police-officer-mohamed-said.jpg",
        "incident_description":"Corporal Mohamed Said was shot and killed near the intersection of Oakwood Boulevard and Dix Road while pursuing a subject at 11:38 a.m. \n\nOfficers were dispatched to a call for service at a nearby carwash. Corporal Said arrived at the scene and pursued one of the subjects, who opened fire, fatally wounding him.\n\nThe subject, who was paroled in June, fled the scene on a stolen bicycle. After an intensive manhunt by local, county, and federal agencies, he was apprehended the next day. Corporal Said's handcuffs were used to secure the suspect. He has been charged with murder, being a felon in possession of a firearm, carrying a concealed weapon, and drug possession. \n\nCorporal Said had served with the Melvindale Police Department for 14 months. He is survived by his parents and younger siblings.",
        "age":"26",
        "tour":"1 year, 2 months",
        "badge":"10",
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"42.2838780",
        "lon":"-83.1690679"
    },
    {
        "name":"Correctional Officer Hunter Scott Miller",
        "officer_name":"Correctional  Hunter Scott Miller",
        "title":"Officer",
        "department_name":"Kentucky Department of Corrections",
        "state_abbreviation":"KY",
        "cause":"Heart attack",
        "date":"2024-07-25",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27117-correctional-officer-hunter-scott-miller",
        "photo_url":"27117\/125\/c_hunter-miller.jpg",
        "incident_description":"Correctional Officer Hunter Miller suffered a fatal heart attack at the Northpoint Training Center at 710 Walter Reed Road in Burgin. \n\nOfficer Miller was completing his physical training test for the Emergency Response Team when he collapsed at 7:53 a.m. Despite life-saving measures, he was unable to be resuscitated and passed away at a local hospital. \n\nOfficer Miller had served with the Kentucky Department of Corrections for two years and was assigned to the Northpoint Training Center. He is survived by his mother, sister, and stepmother.",
        "age":"24",
        "tour":"2 years",
        "badge":"489",
        "weapon":null,
        "offender":null,
        "lat":"37.7094751",
        "lon":"-84.7454881"
    },
    {
        "name":"Senior Corporal Segus R. Jolivette",
        "officer_name":"Senior  Segus R. Jolivette",
        "title":"Corporal",
        "department_name":"Lafayette Police Department",
        "state_abbreviation":"LA",
        "cause":"Gunfire",
        "date":"2024-07-25",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27106-senior-corporal-segus-r-jolivette",
        "photo_url":"27106\/125\/c_2024_jolivette.jpg",
        "incident_description":"Senior Corporal Segus Jolivette was shot and killed during a hostage barricade at the 2500 block of Martin Luther King Boulevard in Jeanerette.\n\nAn officer with the Jeanerette Marshal's Office attempted to serve a warrant on a convicted felon, but the subject barricaded himself and two people inside the trailer. When Corporal Jolivette and other officers entered the home, they were met with gunfire. Corporal Jolivette died from his wounds. Three other officers were injured with non-life-threatening injuries.  \n\nThe subject was taken into custody. \n\nCorporal Jolivette had served with the Lafayette Police Department for 11 years and previously served with the Opelousas Police Department. He was a member of the SWAT negotiator team and supported the Explorer program. He is survived by his wife and five children.",
        "age":"35",
        "tour":"15 years",
        "badge":"13854",
        "weapon":"Gun; Unknown type",
        "offender":"Apprehended",
        "lat":"29.9165404",
        "lon":"-91.6797123"
    },
    {
        "name":"Deputy Sheriff Rafael Wordlaw",
        "officer_name":"Rafael Wordlaw",
        "title":"Deputy",
        "department_name":"Cook County Sheriff's Office - Department of Corrections",
        "state_abbreviation":"IL",
        "cause":"Gunfire",
        "date":"2024-07-30",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27107-deputy-sheriff-rafael-wordlaw",
        "photo_url":"27107\/125\/c_wordlaw-1.png",
        "incident_description":"Deputy Sheriff Rafael Wordlaw was shot and killed at about 1:25 am when he intervened in an armed robbery on the 500 block of E 67th Street, in Woodlawn, while he was off duty.\n\nHe was sitting in a car at a gas station when an armed subject attempted to rob his friend, who was pumping gas. Deputy Wordlaw drew his weapon and attempted to intervene in the robbery. During a subsequent exchange of gunfire, Deputy Wordlaw was struck in the chest.\n\nThe subject was armed with two handguns, one of which had a drum magazine and converted to fully automatic. The offender fired 69 rounds at Deputy Wordlaw during the shooting. One of the rounds struck Deputy Wordlaw's firearm and disabled it after he fired one round, which struck the subject in the leg. Deputy Wordlaw's friend was also wounded.\n\nThe man was arrested several hours later at a local hospital while seeking treatment for his gunshot wound. He was charged with first-degree murder, attempted first-degree murder, attempted armed robbery with a firearm, and numerous other felonies. He had recently been released from prison after serving only one year of an eight-year sentence for multiple felony firearms-related charges.\n\nDeputy Wordlaw had served with the Cook County Sheriff's Office - Department of Corrections for 4-1\/2 years and was assigned to Division 6 of the Cook County Jail. He is survived by his father, who served with the Chicago Police Department, and his aunt, who raised him.",
        "age":"31",
        "tour":"Not available",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Charged with murder",
        "lat":"41.7728361",
        "lon":"-87.6127216"
    },
    {
        "name":"Police Officer Demetrice Lavelle Johnson",
        "officer_name":"Demetrice Lavelle Johnson",
        "title":"Police",
        "department_name":"Memphis Police Department",
        "state_abbreviation":"TN",
        "cause":"Automobile crash",
        "date":"2024-08-02",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27108-police-officer-demetrice-lavelle-johnson",
        "photo_url":"27108\/125\/police-officer-demetrice-johnson.jpg",
        "incident_description":"Police Officer Demetrice Johnson was killed in a vehicle crash at the intersection of Mississippi Boulevard and Danny Thomas Boulevard at about 3:00 am.\n\nA vehicle fleeing the scene of a nearby shooting collided with the patrol car Officer Johnson was in. The other driver, who had been wounded in the shooting, was also killed in the crash. Officer Johnson's partner suffered critical injuries.\n\nOfficer Johnson had served with the Memphis Police Department for just over one year and had graduated from the police academy only three months prior. He was assigned to the North Main Station. He is survived by his wife and young son.",
        "age":"34",
        "tour":"1 year, 4 months",
        "badge":"6764",
        "weapon":null,
        "offender":null,
        "lat":"35.1318180",
        "lon":"-90.0474180"
    },
    {
        "name":"Sheriff Roy \"Sonny\" Weatherford",
        "officer_name":"Roy \"Sonny\" Weatherford",
        "title":"Sheriff",
        "department_name":"Sumner County Sheriff's Office",
        "state_abbreviation":"TN",
        "cause":"Fall",
        "date":"2024-08-02",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27111-sheriff-roy-sonny-weatherford",
        "photo_url":"27111\/125\/sheriff-roy-sonny-weatherford.jpg",
        "incident_description":"Sheriff Sonny Weatherford succumbed to injuries sustained the previous day when he fell while attending the 2024 Tennessee Sheriff's Association Conference at Sevierville Convention Center.\n\nHe suffered a severe head injury as a result of the fall and was transported to a local hospital where he passed away the following day.\n\nSheriff Weatherford had served with the Sumner County Sheriff's Office for 39 years and had served as sheriff for 14 years. He had previously served with the Portland Police Department for two years. He is survived by his wife, two sons, four grandchildren, and three siblings.",
        "age":"65",
        "tour":"41 years",
        "badge":"1",
        "weapon":null,
        "offender":null,
        "lat":"35.8938127",
        "lon":"-83.5887115"
    },
    {
        "name":"Master Deputy Sheriff Bradley Michael Link",
        "officer_name":"Master   Bradley Michael Link",
        "title":"Deputy",
        "department_name":"Lake County Sheriff's Office",
        "state_abbreviation":"FL",
        "cause":"Gunfire",
        "date":"2024-08-03",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27109-master-deputy-sheriff-bradley-michael-link",
        "photo_url":"27109\/125\/master-deputy-bradley-link.jpg",
        "incident_description":"Master Deputy Sheriff Brad Link was shot and killed when he and other deputies responded to a disturbance at a home on Brookside Drive near County Road 439 in Eustis.\n\nAs deputies responded to the initial 911 call, they were directed to a second nearby house after apprehending a female subject. When they arrived at that location, they discovered two dead dogs outside, a door had been kicked in, and they could hear yelling inside. As they entered the home, a subject inside opened fire on them from ambush. Deputy Link was shot and became trapped inside. Two other deputies were wounded one critically, during the incident and subsequent attempt to rescue Deputy Link.\n\nDeputy Link was transported to a local hospital where he was pronounced dead early the following morning.\n\nThree people inside the home were found with self-inflicted gunshot wounds. The female, who was apprehended, was transported to AdventHealth Waterman Hospital for a mental and physical evaluation. She has been charged with principal to murder in the first degree of a law enforcement officer, three counts of principal to attempted first-degree murder of a law enforcement officer, conspiracy to commit murder in the first degree - premeditated, battery on a law enforcement or other officer, and three counts of battery.\n\nDeputy Link was a U.S. Army Reserves veteran. He had served with the Lake County Sheriff's Office for 4-1\/2 years and had previously served with the Polk County Sheriff's Office for two years. He had also served as an Explorer with the Lake County Sheriff's Office as a teenager. He is survived by his wife.",
        "age":"28",
        "tour":"6 years, 6 months",
        "badge":"2836",
        "weapon":"Gun; Unknown type",
        "offender":"Charged with 1st degree murder",
        "lat":"28.9067891",
        "lon":"-81.5924792"
    },
    {
        "name":"Patrolman Troy Floyd",
        "officer_name":"Troy Floyd",
        "title":"Patrolman",
        "department_name":"Summit Police Department",
        "state_abbreviation":"MS",
        "cause":"Gunfire",
        "date":"2024-08-08",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27110-patrolman-troy-floyd",
        "photo_url":"27110\/125\/patrolman-troy-floud.jpg",
        "incident_description":"Patrolman Troy Floyd was shot and killed while conducting a checkpoint near W Railroad Avenue.\n\nA passenger in a vehicle that approached the checkpoint opened fire, fatally wounding Patrolman Floyd.\n\nOfficers from the McComb Police Department responded to assist the Summit Police Department following the shootings. Two of the McComb officers located the subject at a nearby grocery store and exchanged shots with the man. Both officers were wounded and the man was killed during the shootout.\n\nPatrolman Floyd had served in law enforcement for over 20 years. He is survived by his wife and children.",
        "age":"Not available",
        "tour":"20 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"31.2837347",
        "lon":"-90.4671019"
    },
    {
        "name":"Deputy Sheriff Hunter Reedy",
        "officer_name":"Hunter Reedy",
        "title":"Deputy",
        "department_name":"Smyth County Sheriff's Office",
        "state_abbreviation":"VA",
        "cause":"Gunfire",
        "date":"2024-08-09",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27113-deputy-sheriff-hunter-reedy",
        "photo_url":"27113\/125\/c_hunter-reedy.jpg",
        "incident_description":"Deputy Sheriff Hunter Reedy was shot and killed while assisting officers from the Marion Police Department with a traffic stop at about 5:00 pm.\n\nA Marion police officer had initiated the stop for a moving violation in the town; however, the vehicle drove approximately 1-1\/2 miles into Smyth County before stopping near the intersection of Route 16 and Hatchery Road. Several Smyth County deputies responded to assist with the stop.\n\nThe driver became extremely agitated after being issued a traffic summons by the officer. The man then shot one of the deputies who approached him. During the ensuing exchange of gunfire, the subject and a second deputy were shot. The subject died a week later. \n\nDeputy Reedy had served with the Smyth County Sheriff's Office for seven years. He is survived by his wife, three children, parents, sister, and grandfather.",
        "age":"27",
        "tour":"7 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"36.8235535",
        "lon":"-81.4772662"
    },
    {
        "name":"Sergeant Billy Randolph",
        "officer_name":"Billy Randolph",
        "title":"Sergeant",
        "department_name":"Fort Worth Police Department",
        "state_abbreviation":"TX",
        "cause":"Struck by vehicle",
        "date":"2024-08-12",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27115-sergeant-billy-randolph",
        "photo_url":"27115\/125\/c_randolph_billy.jpg",
        "incident_description":"Sergeant Billy Randolph was struck and killed at a crash scene on Interstate 35 near Sycamore School Road at 5:30 a.m.\n\nA tractor-trailer collided with a guardrail and caught fire. During the clean-up, Sergeant Randolph was standing outside his patrol vehicle when a vehicle drove the wrong way through barricades and struck him. He was transported to John Peter Smith Hospital where he died from his injuries.\n\nThe driver continued driving and when she stopped her car, fled on foot. She was apprehended and charged with intoxication manslaughter.\n\nSergeant Randolph was a United States Air Force veteran and had served with the Fort Worth Police Department for 29 years. He is survived by his wife and children.",
        "age":"Not available",
        "tour":"29 years",
        "badge":"2797",
        "weapon":"Automobile; Alcohol involved",
        "offender":"In custody",
        "lat":"32.6352034",
        "lon":"-97.3216418"
    },
    {
        "name":"Deputy Sheriff Brandon Cunningham",
        "officer_name":"Brandon Cunningham",
        "title":"Deputy",
        "department_name":"Paulding County Sheriff's Office",
        "state_abbreviation":"GA",
        "cause":"Gunfire",
        "date":"2024-08-17",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27118-deputy-sheriff-brandon-cunningham",
        "photo_url":"27118\/125\/c_deputy_brandon_cunningham.jpg",
        "incident_description":"Deputy Sheriff Brandon Cunningham was shot and killed while responding to a domestic call in Hiram.\n\nShortly after 6:00 p.m., Deputy Cunningham and his partner arrived at the home and were ambushed with a hail of gunfire as soon as they exited their vehicle. Responding officers were also met with a stream of gunfire. When a female attempted to leave the home, she was shot. \n\nDeputy Cunningham was transported to a local hospital where he died from his wounds. \n\nThe suspect was found with a self-inflicted gunshot wound. \n\nDeputy Cunningham had served with the Paulding County Sheriff's Office for over four years. He was survived by his son, daughter, mother, three brothers, grandfather, and aunt.",
        "age":"30",
        "tour":"4 years, 6 months",
        "badge":"1169",
        "weapon":"Gun; Unknown type",
        "offender":"Committed suicide",
        "lat":"33.8741525",
        "lon":"-84.7717516"
    },
    {
        "name":"Patrolman James Crowley",
        "officer_name":"James Crowley",
        "title":"Patrolman",
        "department_name":"Chicago Police Department",
        "state_abbreviation":"IL",
        "cause":"Vehicular assault",
        "date":"2024-08-22",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27133-patrolman-james-crowley",
        "photo_url":"27133\/125\/c_crowley_james_.jpg",
        "incident_description":"Patrolman Jim Crowley succumbed to injuries he received on September 4, 1987, when a drunk driver struck his patrol car. \n\nPatrolman Crowley, Patrolman William Morrison, and three other officers were working special assignment for Public Housing North and were en route to a call of a juvenile with a gun. While traveling westbound on 15th Street, a car traveling northbound on Ashland Avenue broadsided their patrol car at 8:15 p.m. \n\nThree officers were taken to local hospitals and released. Patrolman Morrisson was pronounced dead on arrival at Cook County Hospital. Patrolman Crowley was transported to the University of Illinois Research Hospital with severe head trauma. Due to his injuries, he was unable to walk and was confined to a wheelchair. He passed away from his injuries almost 37 years later. \n\nThe driver was convicted of reckless homicide and driving under the influence and was sentenced to three years. \n\nPatrolman Crawley had served with the Chicago Police Department for one year. He is survived by his mother, sister, two nephews, and two nieces.",
        "age":"59",
        "tour":"1 year",
        "badge":"4169",
        "weapon":"Automobile; Alcohol involved",
        "offender":"Sentenced to 3 years",
        "lat":"41.8615080",
        "lon":"-87.6662540"
    },
    {
        "name":"Investigator Taylor Jaimeson Bristow",
        "officer_name":"Taylor Jaimeson Bristow",
        "title":"Investigator",
        "department_name":"Carroll County Sheriff's Office",
        "state_abbreviation":"GA",
        "cause":"Gunfire",
        "date":"2024-08-23",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27123-investigator-taylor-jaimeson-bristow",
        "photo_url":"27123\/125\/investigator-taylor-bristow.jpg",
        "incident_description":"Investigator Taylor Bristow succumbed to a gunshot wound sustained three days earlier while serving a warrant related to a child sexual exploitation investigation.\n\nHe was assisting agents with the Georgia Bureau of Investigation to serve the warrant at a home on Don Rich Drive south of Carrollton at 8:30 a.m. The wanted subject opened the door and let the investigators into the house. As they entered the home, the man produced a handgun and shot himself in an attempt to commit suicide. The round also struck Investigator Bristow.\n\nInvestigator Bristow was transported to Grady Memorial Hospital where he remained until succumbing to the wound on August 23rd, 2024.\n\nInvestigator Bristow had served with the Carroll County Sheriff's Office for six years. He had previously served with the Ware County Sheriff's Office and Waycross Police Department. He is survived by his wife, two children, parents, sister, and two brothers.",
        "age":"30",
        "tour":"6 years",
        "badge":"943",
        "weapon":"Handgun",
        "offender":"Committed suicide",
        "lat":"33.5351166",
        "lon":"-85.0786650"
    },
    {
        "name":"Police Officer Austin Machitar",
        "officer_name":"Austin Machitar",
        "title":"Police",
        "department_name":"San Diego Police Department",
        "state_abbreviation":"CA",
        "cause":"Vehicular assault",
        "date":"2024-08-26",
        "year":2024,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27125-police-officer-austin-machitar",
        "photo_url":"27125\/125\/c_austin-machitar.jpg",
        "incident_description":"Police Officer Austin Machitar was killed in a vehicle crash at 11:30 p.m. at the 5200 block of Clairemont Mesa Boulevard.\n\nAn officer was pursuing a speeding vehicle that failed to yield for a traffic stop. When the pursuit reached a high rate of speed, it was called off. Officer Machitar and his partner were responding to the area of the fleeing suspect when the fleeing car slammed into Officer Machitar's patrol vehicle at 90 mph, causing the police cruiser to be engulfed in flames. Officer Machitar was pronounced dead at the crash site. The other officer was transported to Sharp Memorial Hospital in critical condition.\n\nThe driver of the pursuit vehicle died in the crash. \n\nOfficer Machitar had served with the San Diego Police Department for over five years. He is survived by his parents and sister.",
        "age":"30",
        "tour":"5 years, 5 months",
        "badge":"7989",
        "weapon":"Automobile",
        "offender":"Died in the crash",
        "lat":"32.8344278",
        "lon":"-117.1786813"
    },
    {
        "name":"Investigator Wayne David",
        "officer_name":"Wayne David",
        "title":"Investigator",
        "department_name":"Metropolitan Police Department",
        "state_abbreviation":"DC",
        "cause":"Gunfire (Inadvertent)",
        "date":"2024-08-28",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27126-investigator-wayne-david",
        "photo_url":"27126\/125\/investigator-wayne-david.jpg",
        "incident_description":"Investigator Wayne David was shot and killed when a firearm he was recovering from a storm drain inadvertently discharged.\n\nHe and other officers had attempted to speak to a man who was in a suspicious vehicle in the 4500 block of Quarles Street NE at about 5:45 pm. The man fled on foot toward Eastern Avenue NE and jumped down onto DC-295, where he threw a firearm into a storm drain. A passing motorcyclist then picked the man up, and they fled the scene.\n\nInvestigator David was attempting to retrieve the firearm from the drain when it discharged, striking him in the head. He was flown to MedStar Washington Hospital Center where he succumbed to his wound several hours later.\n\nA subject was arrested eight days later and charged with unlawful possession of a firearm. \n\nInvestigator David had served with the Metropolitan Police Department for 26 years and was assigned to the Violent Crime Suppression Division. He is survived by his son and daughter. His brother retired from the Metropolitan Police Department.",
        "age":"51",
        "tour":"26 years",
        "badge":"IV1920",
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"38.9120097",
        "lon":"-76.9344906"
    },
    {
        "name":"Police Officer Darron Lee Burks",
        "officer_name":"Darron Lee Burks",
        "title":"Police",
        "department_name":"Dallas Police Department",
        "state_abbreviation":"TX",
        "cause":"Gunfire",
        "date":"2024-08-29",
        "year":2024,
        "weekday":"Thursday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27127-police-officer-darron-lee-burks",
        "photo_url":"27127\/125\/c_burks.jpg",
        "incident_description":"Police Officer Darron Burks was shot and killed in his squad car at the 900 block of East Ledbetter Drive. \n\nAt 10:10 p.m., officers responded to an officer in-distress call. When they arrived at the 900 block of East Ledbetter Drive, they approached a man standing near the squad car. The subject opened fire, shooting one officer three times and another officer in the face. Responding officers found Officer Burks in his patrol vehicle suffering from a gunshot wound. \n\nAs soon as the suspect fled, a pursuit ensued. When the suspect stopped at the 100 block of Stemmons Freeway in Lewisville, he exited his vehicle with a long gun and was shot and killed. \n\nThe three officers were transported to area hospitals. One is in stable condition, and another is in critical condition. Officer Burks succumbed to his wounds.\n\nOfficer Burks had served with the Dallas Police Department for eight months. He is survived by his parents.",
        "age":"46",
        "tour":"8 months",
        "badge":"12543",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"32.6835875",
        "lon":"-96.8110620"
    },
    {
        "name":"Officer Phylicia Carson",
        "officer_name":"Phylicia Carson",
        "title":"Officer",
        "department_name":"Osage Beach Police Department",
        "state_abbreviation":"MO",
        "cause":"Vehicle pursuit",
        "date":"2024-08-31",
        "year":2024,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27128-officer-phylicia-carson",
        "photo_url":"27128\/125\/c_phylicia-carson-2.jpg",
        "incident_description":"Officer Phylicia Carson was killed in a vehicle crash at about 1:30 am while responding to assist another officer who was pursuing a vehicle.\n\nHer patrol car left the roadway and struck a tree on Highway A near Toronto Springs Park Road. A Camden County Sheriff's Office deputy discovered her patrol car on fire in the tree line.\n\nThe driver of the vehicle that was being pursued crashed a short distance away and was taken into custody. He was charged with aggravated fleeing a stop, resulting in death.\n\nOfficer Carson had served with the Osage Beach Police Department for one year. She is survived by her husband and six children.",
        "age":"33",
        "tour":"1 year",
        "badge":"916",
        "weapon":"Automobile",
        "offender":"In custody",
        "lat":"37.9949168",
        "lon":"-92.5137080"
    },
    {
        "name":"Police Officer Zane Tristan Coolidge",
        "officer_name":"Zane Tristan Coolidge",
        "title":"Police",
        "department_name":"Phoenix Police Department",
        "state_abbreviation":"AZ",
        "cause":"Gunfire",
        "date":"2024-09-06",
        "year":2024,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27137-police-officer-zane-tristan-coolidge",
        "photo_url":"27137\/125\/police-officer-zane-coolidge.jpg",
        "incident_description":"Police Officer Zane Coolidge succumbed to gunshot wounds sustained three days earlier while responding to reports of a larceny from a motor vehicle near the intersection of 16th Street and McDowell Road at about 6:30 pm.\n\nAs officers arrived on scene, the suspect fled on foot and jumped a fence into a backyard. The man then opened fire on officers, striking Officer Coolidge and a second officer before being taken into custody.\n\nOfficer Coolidge was transported to a local hospital where he remained until succumbing to his wounds three days later.\n\nThe suspect, a multi-times convicted felon who was on parole, has been charged with first-degree murder and illegal possession of a weapon.\n\nOfficer Coolidge had served with the Phoenix Police Department for five years. He is survived by his wife and infant daughter.",
        "age":"29",
        "tour":"5 years",
        "badge":"10914",
        "weapon":"Gun; Unknown type",
        "offender":"Arrested",
        "lat":"33.4658093",
        "lon":"-112.0477257"
    },
    {
        "name":"Police Officer Jaime Roman",
        "officer_name":"Jaime Roman",
        "title":"Police",
        "department_name":"Philadelphia Police Department",
        "state_abbreviation":"PA",
        "cause":"Gunfire",
        "date":"2024-09-10",
        "year":2024,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27139-police-officer-jaime-roman",
        "photo_url":"27139\/125\/c_roman-jaime.jpg",
        "incident_description":"Police Officer Jaime Roman succumbed to gunshot wounds he received on June 22, 2024, during a traffic stop. \n\nOfficer Roman and another officer initiated a traffic stop at the 3500 block of F Street in Kensington at 7:18 p.m. They determined that the vehicle was unregistered and the driver did not have a license. Officers called for a tow truck, and they allowed the driver to call for a ride. While his three friends helped him retrieve items from his car, officers spotted a gun holster. They questioned the driver about it, but he ran. As he fled, the man turned in the middle of the road and fired three shots, one of them hitting Officer Roman in the neck. The other officer returned fire but did not hit the subject. \n\nOfficer Roman was transported to Temple Hospital and remained on life support until succumbing to his wounds on September 10, 2024.\n\nThe suspect was apprehended after he attempted to carjack a vehicle and held a man hostage before barricading himself in a house. The suspect was charged with two counts of attempted murder of a police officer, two counts of aggravated assault on a police officer, evading arrest, and tampering with physical evidence. He is being held on a $12.5 million bond. \n\nOfficer Roman had served with the Philadelphia Police Department for 6-1\/2 years, assigned to the 25th District. He is survived by his wife and children.",
        "age":"31",
        "tour":"6 years, 6 months",
        "badge":"6064",
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"40.0015952",
        "lon":"-75.1164287"
    },
    {
        "name":"Corporal Brandon Schreiber",
        "officer_name":"Brandon Schreiber",
        "title":"Corporal",
        "department_name":"Newton County Sheriff's Department",
        "state_abbreviation":"IN",
        "cause":"Gunfire",
        "date":"2024-09-11",
        "year":2024,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27140-corporal-brandon-schreiber",
        "photo_url":"27140\/125\/c_schreiber_brandon.jpg",
        "incident_description":"Corporal Brandon Schreiber succumbed to gunshot wounds he received after a vehicle pursuit on September 1, 2024. \n\nCorporal Schreiber joined a pursuit initiated by the Iroquois County Sheriff's Office (Illinois) when the driver, who was armed, fled into Indiana. The pursuit returned to Illinois, where the suspect crashed his vehicle in Sheldon. When the subject exited his vehicle, gunfire was exchanged. Corporal Schreiber was struck and transported to Iroquois Memorial Hospital in critical condition. \n\nThe suspect died at the scene. \n\nCorporal Schreiber was later transferred to the Carle Trauma Center, where he remained on life support until his organs could be donated.\n\nCorporal Schreiber had served with the Newton County Sheriff's Department for five years.",
        "age":"Not available",
        "tour":"5 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"40.7773252",
        "lon":"-87.5639369"
    },
    {
        "name":"K9 Nyx",
        "officer_name":"Nyx",
        "title":"K9",
        "department_name":"Rockford Police Department",
        "state_abbreviation":"IL",
        "cause":"Gunfire",
        "date":"2024-01-28",
        "year":2024,
        "weekday":"Sunday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1910-k9-nyx",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1910\/125\/c_k9-nyx.jpg",
        "incident_description":"K9 Nyx was shot and killed while tracking a suspect involved in a domestic incident. \n\nOfficers were investigating a domestic situation and searching for the suspect. When K9 Nyx tracked the suspect to the 2900 Block of 11th Street in Rockford, gunfire ensued. K9 Nyx was shot and killed by the suspect. \n\nThe suspect sustained a non-life-threatening wound to his leg and was apprehended.  \n\nNyx served with the Rockford Police Department for almost 6 years. She was trained in narcotics detection, evidence recovery, human tracking, and apprehension.",
        "age":"7",
        "tour":"6 years",
        "badge":null,
        "weapon":null,
        "offender":"In custody",
        "lat":"42.2324192",
        "lon":"-89.0721452"
    },
    {
        "name":"K9 Maze",
        "officer_name":"Maze",
        "title":"K9",
        "department_name":"West Virginia Division of Natural Resources - Law Enforcement Section",
        "state_abbreviation":"WV",
        "cause":"Training accident",
        "date":"2024-02-01",
        "year":2024,
        "weekday":"Thursday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1913-k9-maze",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1913\/125\/c_maze.jpg",
        "incident_description":"K9 Maze collided with a vehicle while participating in article search training in Cabell County at 9:30 a.m.\n\nK9 Maze had just completed a search and was receiving her reward. At the same time, a car was driving past, she ran into the one-lane road and struck the car.  \n\nK9 Maze had served with the West Virginia Division of Natural Resources - Law Enforcement Section for over one year.",
        "age":"2",
        "tour":"1 year, 2 months",
        "badge":null,
        "weapon":"Automobile",
        "offender":null,
        "lat":"38.3664750",
        "lon":"-81.6933320"
    },
    {
        "name":"K9 Leo",
        "officer_name":"Leo",
        "title":"K9",
        "department_name":"Marion County Sheriff's Office",
        "state_abbreviation":"FL",
        "cause":"Gunfire",
        "date":"2024-02-20",
        "year":2024,
        "weekday":"Tuesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1911-k9-leo",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1911\/125\/c_leo.jpg",
        "incident_description":"K9 Leo succumbed to gunshot wounds he received during a domestic call at the 900 block of Northwest 114th Court in Silver Springs on February 17, 2024. \n\nWhen Marion County Sheriff's deputies arrived at the scene, the subject, accused of battery by strangulation, fired at them from the backyard. K9 Leo was struck in an area not covered by his protective armor. Deputies returned fire, killing the subject. \n\nK9 Leo was transported to the UF Animal Hospital in Gainesville where he died three days later. \n\nK9 Leo had served with the Marion County Sheriff's Office for three years.",
        "age":"4",
        "tour":"3 years",
        "badge":null,
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"29.1961658",
        "lon":"-81.9128877"
    },
    {
        "name":"K9 Luca",
        "officer_name":"Luca",
        "title":"K9",
        "department_name":"DeSoto County Sheriff's Office",
        "state_abbreviation":"MS",
        "cause":"Gunfire",
        "date":"2024-02-21",
        "year":2024,
        "weekday":"Wednesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1912-k9-luca",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1912\/125\/c_luca-4.jpg",
        "incident_description":"K9 Luca was shot and killed after a vehicle pursuit in Lake Cormorant in Mississippi. \n\nA subject fled in a vehicle from DeSoto County Sheriff's deputies on Highway 61. The car crashed after deputies deployed a PIT maneuver near Star Landing Road. When the subject's vehicle stopped, K9 Luca was unleashed. The subject fired at K9 Luca, striking him. Deputies returned fire, killing the subject.  \n\nK9 Luca was transported to a veterinary hospital where he succumbed to his wounds.\n\nK9 Luca had served with the DeSoto County Sheriff's Office for four years and previously served with the Army 7th Special Forces Group, Multi-Purpose Canine Combat Tracking Detatchment (7thSFG SOFMPC) at Elgin Air Force Base in Florida for five years.",
        "age":"11",
        "tour":"9 years",
        "badge":null,
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"34.9039923",
        "lon":"-90.1954350"
    },
    {
        "name":"K9 Raiden",
        "officer_name":"Raiden",
        "title":"K9",
        "department_name":"Tomah Police Department",
        "state_abbreviation":"WI",
        "cause":"Struck by vehicle",
        "date":"2024-03-04",
        "year":2024,
        "weekday":"Monday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1915-k9-raiden",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1915\/125\/c_raiden.jpg",
        "incident_description":"K9 Raiden was struck and killed by a vehicle on Wisconsin Highway 12\/16 east of Tomah. \n\nK9 Raiden was on routine patrol with his handler and stopped at an outdoor area to relieve himself. He ran onto the highway and was hit by a passing vehicle. He was transported to a Veterinary Hospital in Madison, where he succumbed to his injuries.\n\nK9 Raiden had served with the Tomah Police Department for one month and was also a member of the Monroe County Combined Tactical Unit.",
        "age":"Not available",
        "tour":"1 month",
        "badge":null,
        "weapon":"Automobile",
        "offender":null,
        "lat":"43.9721283",
        "lon":"-90.4967896"
    },
    {
        "name":"K9 Rivan",
        "officer_name":"Rivan",
        "title":"K9",
        "department_name":"Virginia Department of Corrections",
        "state_abbreviation":"VA",
        "cause":"Stabbed",
        "date":"2024-04-02",
        "year":2024,
        "weekday":"Tuesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1916-k9-rivan",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1916\/125\/c_k9-rivan.jpg",
        "incident_description":"K9 Rivan was stabbed to death while trying to stop an attack on an inmate by four other inmates at the Sussex I State Prison at 24414 Musselwhite Drive in Waverly, Virginia. \n\nThree inmates began violently assaulting another inmate as a fourth inmate watched. K9 Rivan and his handler attempted to stop the attack and save the inmate's life. The three inmates kicked and stabbed K9 Rivan repeatedly as officers responded to subdue the inmates. \n\nDespite lifesaving measures by the Virginia Department of Corrections staff, K9 Rivan succumbed to his wounds. K9 Rivan's handler did not sustain any serious injuries. \n\nThe victim inmate was treated at a local hospital and returned to the Sussex State Prison. \n\nThe four inmates involved in the attack were members of MS-13 and serving time for serious felonies such as homicide, attempted rape, abduction, and child pornography while being in the United States illegally. \n\nK9 Rivan had served with the Virginia Department of Corrections for almost five years. His mother served with the United States Secret Service and his father served with a police department in Southwest Virginia.",
        "age":"5",
        "tour":"4 years, 9 months",
        "badge":null,
        "weapon":"Edged weapon",
        "offender":"In custody",
        "lat":"37.0455935",
        "lon":"-77.2002754"
    },
    {
        "name":"K9 Dax",
        "officer_name":"Dax",
        "title":"K9",
        "department_name":"Lake County Sheriff's Office",
        "state_abbreviation":"IL",
        "cause":"Duty related illness",
        "date":"2024-04-12",
        "year":2024,
        "weekday":"Friday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1920-k9-dax",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1920\/125\/c_dax.jpg",
        "incident_description":"K9 Dax succumbed to injuries he received while apprehending a fleeing suspect just before midnight on March 3, 2024. \n\nOfficers from the Pleasant Prairie Police Department, Wisconsin, were pursuing a juvenile driver in a stolen vehicle who crossed the state line from Wisconsin into Illinois. After colliding with a squad car, the driver crashed the stolen vehicle at the 41000 block of North Green Bay Road in Unincorporated Zion and fled on foot. K9 Dax and his handler tracked the suspect into a wooden area. When he refused to surrender, K9 Dax was released for an apprehension and bit the subject.  \n\nThe suspect was charged in Illinois and Wisconsin. \n\nDuring the apprehension, K9 Dax injured his neck and spine, resulting in him being unable to walk on his hind legs. K9 Dax went through physical therapy but was unable to return to duty. His condition declined, and five weeks later, on April 12, 2024, he was humanely euthanized.\n\nK9 Dax had served with the Lake County Sheriff's Office for nine years. He received the 2018 K9s of Valor Foundation \"K-9 of the Year\" award and the 2023 Illinois Law Enforcement Medal of Honor.",
        "age":"10",
        "tour":"9 years",
        "badge":null,
        "weapon":null,
        "offender":null,
        "lat":"42.4559231",
        "lon":"-87.8789008"
    },
    {
        "name":"K9 Max",
        "officer_name":"Max",
        "title":"K9",
        "department_name":"Regional Transportation District Transit Police Department",
        "state_abbreviation":"CO",
        "cause":"Exposure to toxins",
        "date":"2024-05-08",
        "year":2024,
        "weekday":"Wednesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1918-k9-max",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1918\/125\/c_max.jpg",
        "incident_description":"K9 Max was humanely euthanized after developing pulmonary neoplasia from prolonged exposure to black smoke and explosives.\n\nK9 Max had served with the Regional Transportation District Transit Police Department for 4 1\/2 years. \n\nIn 2021, K9 Max won the National Police Canine Association (NPCA) Detection Case of the Year.",
        "age":"6",
        "tour":"4 years, 5 months",
        "badge":null,
        "weapon":"Toxic chemicals",
        "offender":null,
        "lat":"39.7509552",
        "lon":"-104.9985005"
    },
    {
        "name":"K9 Coba",
        "officer_name":"Coba",
        "title":"K9",
        "department_name":"South Carolina Law Enforcement Division",
        "state_abbreviation":"SC",
        "cause":"Gunfire",
        "date":"2024-06-11",
        "year":2024,
        "weekday":"Tuesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1921-k9-coba",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1921\/125\/c_coba.jpg",
        "incident_description":"K9 Coba was shot and killed while officers attempted to arrest a fugitive on Gravel Road in Prosperity. \n\nSouth Carolina Law Enforcement Division agents and Newberry County Sheriff's Office deputies were serving a felony fugitive warrant at the home of a relative of the wanted man. After finding the suspect hiding in the home, the man pulled out a gun and fired at officers and K9 Coba, striking K9 Coba. Officers returned fire. \n\nK9 Coba was transported to an emergency veterinarian clinic, where he succumbed to his wounds. Several deputies were treated for minor injuries. \n\nThe suspect was apprehended and taken to an area hospital. \n\nK9 Coba had served with the South Carolina Law Enforcement Division for three years, serving on the SWAT and K9 Tracking teams.",
        "age":"4",
        "tour":"3 years",
        "badge":null,
        "weapon":"Gun; Unknown type",
        "offender":"In custody",
        "lat":"34.1018136",
        "lon":"-81.5431924"
    },
    {
        "name":"K9 Wick",
        "officer_name":"Wick",
        "title":"K9",
        "department_name":"Richland County Sheriff's Department",
        "state_abbreviation":"SC",
        "cause":"Struck by vehicle",
        "date":"2024-06-20",
        "year":2024,
        "weekday":"Thursday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1922-k9-wick",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1922\/125\/c_wick.jpg",
        "incident_description":"K9 Wick was struck and killed by a vehicle while pursuing the suspect of a stolen vehicle around 1:00 a.m.\n\nRichland County deputies attempted to pull over a van that had been reported stolen the day prior. When the subject did not stop, a vehicle pursuit ensued. After using stop sticks on Interstate 77, the suspect stopped at mile marker two and fled on foot. K9 Wick was deployed to track the suspect. During the pursuit, the leash broke, and K9 Wick continued running into the northbound lanes of I-77, where he was struck by oncoming traffic. He succumbed to his injuries at the scene.  \n\nThe driver stopped and is cooperating with authorities. \n\nThe suspect in the stolen vehicle was able to get away but was later apprehended.\n\nK9 Wick had served with the Richland County Sheriff's Department for 1 1\/2 years.",
        "age":"3",
        "tour":"1 year, 6 months",
        "badge":null,
        "weapon":"Automobile",
        "offender":"Apprehended",
        "lat":"33.9292500",
        "lon":"-81.0407167"
    },
    {
        "name":"K9 Archer",
        "officer_name":"Archer",
        "title":"K9",
        "department_name":"Madison County Sheriff's Office",
        "state_abbreviation":"FL",
        "cause":"Heatstroke",
        "date":"2024-07-05",
        "year":2024,
        "weekday":"Friday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1923-k9-archer",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1923\/125\/c_archer.jpg",
        "incident_description":"K9 Archer succumbed to heatstroke after tracking a felon who fled from deputies after a traffic stop on July 4, 2024. \n\nA deputy initiated a traffic stop on Interstate 10 for speeding, but the suspect did not stop. The suspect left the interstate and then crashed his vehicle into a yard on SW Sampala Lake Road in Madison. When the suspect fled on foot, K9 Archer and his handler tracked the suspect to a field. 15 minutes after switching out on the track with another K9, K9 Archer began showing signs of distress. He was transported to Madison Veterinary Clinic for stabilization before receiving treatment at the Allied Veterinary Hospital in Tallahassee. K9 Archer's condition improved, and he was taken to UF Shands Small Animal Hospital in Gainesville. On July 5, his condition worsened, and he passed away. \n\nTemperatures on July 4, 2024, were in the mid-90s, with a heat advisory in effect.\n\nThe suspect was apprehended and has been charged with contributing to the death of K9 Archer, as well as three drug charges and a charge of fleeing or eluding a law enforcement officer at high speed. \n\nK9 Archer had served with the Madison County Sheriff's Office for six years.",
        "age":"7",
        "tour":"6 years",
        "badge":null,
        "weapon":null,
        "offender":"In custody",
        "lat":"30.4234975",
        "lon":"-83.4882557"
    },
    {
        "name":"K9 Vader",
        "officer_name":"Vader",
        "title":"K9",
        "department_name":"Arnold Police Department",
        "state_abbreviation":"MO",
        "cause":"Heatstroke",
        "date":"2024-08-01",
        "year":2024,
        "weekday":"Thursday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1926-k9-vader",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1926\/125\/c_vader.jpg",
        "incident_description":"K9 Vader succumbed to heat-related injuries when the air conditioner and temperature monitoring alarm system failed in his handler's patrol vehicle.\n\nK9 Vader was left in the patrol vehicle with the air conditioning running. When his handler returned, the air conditioning was not on, and the alarm had failed to activate. K9 Vader was taken to Arnold Animal Hospital and, after showing signs of improvement, was transferred to a 24-hour clinic, where he passed away that afternoon.\n\nK9 Vader had served with the Arnold Police Department for three years.",
        "age":"4",
        "tour":"3 years",
        "badge":null,
        "weapon":null,
        "offender":null,
        "lat":"38.4226883",
        "lon":"-90.3758388"
    },
    {
        "name":"K9 Odin",
        "officer_name":"Odin",
        "title":"K9",
        "department_name":"Alton Police Department",
        "state_abbreviation":"IL",
        "cause":"Gunfire",
        "date":"2024-08-22",
        "year":2024,
        "weekday":"Thursday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1927-k9-odin",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1927\/125\/c_odin.jpg",
        "incident_description":"K9 Odin was shot and killed while trying to apprehend a suspect at the 700 block of East 6th Street in Alton. \n\nThe suspect was wanted in connection with a shooting that occurred on the night of August 21, 2024.  While trying to arrest him at 5:40 a.m., the suspect shot K9 Odin and his handler. Officers returned fire, killing the suspect. \n\nK9 Odin was transported to Hawthorne Animal Hospital where he succumbed to his wounds. His handler is recovering from non-life-threatening gunshot wounds.  \n\nK9 Odin had served with the Alton Police Department for seven months.",
        "age":"1",
        "tour":"7 months",
        "badge":null,
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"38.8930511",
        "lon":"-90.1750129"
    }
]