[
    {
        "name":"Lieutenant Mark Meadows",
        "officer_name":"Mark Meadows",
        "title":"Lieutenant",
        "department_name":"Irondale Police Department",
        "state_abbreviation":"AL",
        "cause":"Struck by vehicle",
        "date":"2025-01-06",
        "year":2025,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27294-lieutenant-mark-meadows",
        "photo_url":"27294\/125\/c_meadows-mark.jpg",
        "incident_description":"Lieutenant Mark Meadows was struck and killed by a motorist while directing traffic at Grants Mill Road and Overton Road in Irondale. \n\nShortly before 7:00 a.m., Lieutenant Meadows was putting out cones when he was hit. He was transported to Grandview Medical Center where he succumbed to his injuries.  \n\nLieutenant Meadows was a United States Army veteran. He had served with the Irondale Police Department for 30 years and previously served with the Mountain Brook Police Department. He is survived by his wife, children, and two grandchildren.",
        "age":"60",
        "tour":"33 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"33.5198559",
        "lon":"-86.6571888"
    },
    {
        "name":"Deputy Sheriff Timothy Corlew",
        "officer_name":"Timothy Corlew",
        "title":"Deputy",
        "department_name":"Riverside County Sheriff's Department",
        "state_abbreviation":"CA",
        "cause":"Motorcycle crash",
        "date":"2025-01-08",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27295-deputy-sheriff-timothy-corlew",
        "photo_url":"27295\/125\/c_corlew.jpg",
        "incident_description":"Deputy Sheriff Tim Corlew was killed in a motorcycle crash at 5:30 a.m. on CA 91 east of La Sierra Avenue in Riverside.\n\nWhile traveling westbound in the HOV lane, Deputy Corlew's patrol motorcycle collided with a vehicle, ejecting him from his motorcycle. He was transported to Riverside Community Hospital where he was pronounced deceased.\n\nDeputy Corlew had served with the Riverside County Sheriff's Department for nine years, assigned to the Jurupa Valley Sheriff's Station. He is survived by his wife and two children.",
        "age":"40",
        "tour":"9 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"33.9016110",
        "lon":"-117.4674657"
    },
    {
        "name":"Deputy Sheriff Jesus Vargas",
        "officer_name":"Jesus Vargas",
        "title":"Deputy",
        "department_name":"Brazoria County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Gunfire",
        "date":"2025-01-15",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27298-deputy-sheriff-jesus-vargas",
        "photo_url":"27298\/125\/c_vargas.jpg",
        "incident_description":"Deputy Sheriff Jesus Vargas was shot and killed while serving a warrant at Stella Link Road north of Interstate 610 in Houston at 11:30 a.m.\n\nWhen Deputy Vargas and his partner approached the subject, the suspect fired at deputies from his vehicle. Deputy Vargas was transported to the Ben Taub Hospital where he succumbed to his wounds. \n\nThe suspect, who was a repeat violent offender, fled the scene. When a U.S. Marshals Service canine located the suspect hiding in a dumpster, the suspect fired multiple shots at the K9. A responding officer returned fire, killing the suspect. \n\nThe canine suffered two bullet wounds to the neck and nose and is in stable condition.  \n\nDeputy Vargas had served with the Brazoria County Sheriff's Office for 17 years. He also served with the United States Marshal's Gulf Coast Violent Offenders Task Force. He is survived by his wife and three children.",
        "age":"Not available",
        "tour":"17 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"29.6805021",
        "lon":"-95.4396484"
    },
    {
        "name":"Sergeant Mark Butler",
        "officer_name":"Mark Butler",
        "title":"Sergeant",
        "department_name":"Navasota Police Department",
        "state_abbreviation":"TX",
        "cause":"Vehicular assault",
        "date":"2025-01-15",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27299-sergeant-mark-butler",
        "photo_url":"27299\/125\/c_butler.jpg",
        "incident_description":"Sergeant Mark Butler was killed in a head-on collision during a pursuit on Highway 6 near Farm-to-Market 3090 in Navasota.\n\nWhen College Station officers confronted a female suspect attempting to cash fraudulent checks at a bank, the suspect fled southbound on Highway 6. At the FM 2154 ramp, the suspect exited Highway 6 and reentered the highway, traveling south in the northbound lanes. \n\nAt 3:30 p.m., Sergeant Butler, who was traveling northbound, maneuvered his marked patrol vehicle and collided with the suspect, preventing her from hitting other motorists on the highway. He was transported to CHI St. Joseph Hospital – Grimes Hospital, where he succumbed to his injuries.\n\nThe suspect was killed at the scene. \n\nSergeant Butler was a United States Army veteran and had served with the Navasota Police Department for almost four years.",
        "age":"Not available",
        "tour":"3 years, 8 months",
        "badge":"Not available",
        "weapon":"Automobile",
        "offender":"Killed in the crash",
        "lat":"30.4082474",
        "lon":"-96.0856181"
    },
    {
        "name":"K9 Kaya",
        "officer_name":"Kaya",
        "title":"K9",
        "department_name":"Streetsboro Police Department",
        "state_abbreviation":"OH",
        "cause":"Struck by vehicle",
        "date":"2025-01-07",
        "year":2025,
        "weekday":"Tuesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1936-k9-kaya",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1936\/125\/c_k9-kaya.jpg",
        "incident_description":"K9 Kaya was struck and killed by a passing motorist on SR 303.\n\nAt 5:35 p.m., K9 Kaya exited the patrol vehicle to stretch his legs in an area west of the Streetsboro Police Department. While chasing a ball 600 feet away from the roadway, K9 Kaya unexpectedly redirected and crossed onto SR 303, where a vehicle passing by hit him. He was transported to Metropolitan Veterinary Hospital where he succumbed to his injuries an hour later. \n\nThe driver stayed at the scene and cooperated with the authorities. \n\nK9 Kaya had served with the Streetsboro Police Department for almost nine years. He died three days before his ninth birthday.",
        "age":"8",
        "tour":"8 years, 11 months",
        "badge":null,
        "weapon":"Automobile",
        "offender":null,
        "lat":"41.2386728",
        "lon":"-81.3187015"
    }
]