[
    {
        "name":"Lieutenant Mark Meadows",
        "officer_name":"Mark Meadows",
        "title":"Lieutenant",
        "department_name":"Irondale Police Department",
        "state_abbreviation":"AL",
        "cause":"Struck by vehicle",
        "date":"2025-01-06",
        "year":2025,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27294-lieutenant-mark-meadows",
        "photo_url":"27294\/125\/c_meadows-mark.jpg",
        "incident_description":"Lieutenant Mark Meadows was struck and killed by a motorist while directing traffic at Grants Mill Road and Overton Road in Irondale. \n\nShortly before 7:00 a.m., Lieutenant Meadows was putting out cones when he was hit. He was transported to Grandview Medical Center where he succumbed to his injuries.  \n\nLieutenant Meadows was a United States Army veteran. He had served with the Irondale Police Department for 30 years and previously served with the Mountain Brook Police Department. He is survived by his wife, children, and two grandchildren.",
        "age":"60",
        "tour":"33 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"33.5198559",
        "lon":"-86.6571888"
    },
    {
        "name":"Deputy Sheriff Timothy Corlew",
        "officer_name":"Timothy Corlew",
        "title":"Deputy",
        "department_name":"Riverside County Sheriff's Department",
        "state_abbreviation":"CA",
        "cause":"Motorcycle crash",
        "date":"2025-01-08",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27295-deputy-sheriff-timothy-corlew",
        "photo_url":"27295\/125\/c_corlew.jpg",
        "incident_description":"Deputy Sheriff Tim Corlew was killed in a motorcycle crash at 5:30 a.m. on CA 91 east of La Sierra Avenue in Riverside.\n\nWhile traveling westbound in the HOV lane, Deputy Corlew's patrol motorcycle collided with a vehicle, ejecting him from his motorcycle. He was transported to Riverside Community Hospital where he was pronounced deceased.\n\nDeputy Corlew had served with the Riverside County Sheriff's Department for eight years, assigned to the Jurupa Valley Sheriff's Station. He is survived by his wife and two children.",
        "age":"40",
        "tour":"8 years",
        "badge":"5569",
        "weapon":null,
        "offender":null,
        "lat":"33.9016110",
        "lon":"-117.4674657"
    },
    {
        "name":"Deputy Sheriff Jesus Vargas",
        "officer_name":"Jesus Vargas",
        "title":"Deputy",
        "department_name":"Brazoria County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Gunfire",
        "date":"2025-01-15",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27298-deputy-sheriff-jesus-vargas",
        "photo_url":"27298\/125\/c_vargas.jpg",
        "incident_description":"Deputy Sheriff Jesus Vargas was shot and killed while serving a warrant at Stella Link Road north of Interstate 610 in Houston at 11:30 a.m.\n\nWhen Deputy Vargas and his partner approached the subject, the suspect fired at deputies from his vehicle. Deputy Vargas was transported to the Ben Taub Hospital where he succumbed to his wounds. \n\nThe suspect, who was a repeat violent offender, fled the scene. When a U.S. Marshals Service canine located the suspect hiding in a dumpster, the suspect fired multiple shots at the K9. A responding officer returned fire, killing the suspect. \n\nThe canine suffered two bullet wounds to the neck and nose and is in stable condition.  \n\nDeputy Vargas had served with the Brazoria County Sheriff's Office for 17 years. He also served with the United States Marshal's Gulf Coast Violent Offenders Task Force. He is survived by his wife and three children.",
        "age":"41",
        "tour":"17 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"29.6805021",
        "lon":"-95.4396484"
    },
    {
        "name":"Sergeant Mark Butler",
        "officer_name":"Mark Butler",
        "title":"Sergeant",
        "department_name":"Navasota Police Department",
        "state_abbreviation":"TX",
        "cause":"Vehicular assault",
        "date":"2025-01-15",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27299-sergeant-mark-butler",
        "photo_url":"27299\/125\/c_butler.jpg",
        "incident_description":"Sergeant Mark Butler was killed in a head-on collision during a pursuit on Highway 6 near Farm-to-Market 3090 in Navasota.\n\nWhen College Station officers confronted a female suspect attempting to cash fraudulent checks at a bank, the suspect fled southbound on Highway 6. At the FM 2154 ramp, the suspect exited Highway 6 and reentered the highway, traveling south at speeds of over 100 mph in the northbound lanes. \n\nAt 3:25 p.m., Sergeant Butler, who was traveling northbound, maneuvered his marked patrol vehicle and collided with the suspect, preventing her from hitting other motorists on the highway. He was transported to CHI St. Joseph Hospital – Grimes Hospital, where he succumbed to his injuries.\n\nThe suspect was killed at the scene. \n\nSergeant Butler was a United States Army veteran and had served with the Navasota Police Department for almost four years. He is survived by his wife and two children.",
        "age":"34",
        "tour":"3 years, 8 months",
        "badge":"9306",
        "weapon":"Automobile",
        "offender":"Killed in the crash",
        "lat":"30.4082474",
        "lon":"-96.0856181"
    },
    {
        "name":"Border Patrol Agent David Christopher Maland",
        "officer_name":"Border Patrol  David Christopher Maland",
        "title":"Agent",
        "department_name":"United States Department of Homeland Security - Customs and Border Protection - United States Border Patrol",
        "state_abbreviation":"US",
        "cause":"Gunfire",
        "date":"2025-01-20",
        "year":2025,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27305-border-patrol-agent-david-christopher-maland",
        "photo_url":"27305\/125\/border-patrol-agent-christopher-maland.jpg",
        "incident_description":"Border Patrol Agent Chris Maland was shot and killed during a traffic stop on Interstate 91near Newport, Vermont, near the Canadian Border at 3:15 p.m.\n\nOne suspect was shot and killed, and the second suspect was injured. She is in federal custody.  \n\nAgent Maland was a United States Air Force veteran and had served with the United States Department of Homeland Security - Customs and Border Protection - United States Border Patrol for over nine years. He was assigned to the Swanton Sector. He is survived by his mother, father, brother, and girlfriend.",
        "age":"44",
        "tour":"9 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Killed; In Custody",
        "lat":"44.9254682",
        "lon":"-72.1721878"
    },
    {
        "name":"Officer Baldino Morales-Sánchez",
        "officer_name":"Baldino Morales-Sánchez",
        "title":"Officer",
        "department_name":"Mayagüez Municipal Police Department",
        "state_abbreviation":"PR",
        "cause":"Motorcycle crash",
        "date":"2025-01-25",
        "year":2025,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27307-officer-baldino-morales-snchez",
        "photo_url":"27307\/125\/c_baldino-morales-sanchez-3.jpg",
        "incident_description":"Officer Baldino Morales-Sánchez was killed in a motorcycle crash on PR-406 in Añasco, Puerto Rico, shortly before 2:00 am.\n\nHe was completing his shift at a municipal festival when he was involved in a single-vehicle crash.\n\nOfficer Morales-Sánchez had served with the Mayagüez Municipal Police Department for 20 years and had previously served with the Añasco Municipal Police Department.",
        "age":"62",
        "tour":"28 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"18.2780245",
        "lon":"-67.1090136"
    },
    {
        "name":"Officer Jason Roscow",
        "officer_name":"Jason Roscow",
        "title":"Officer",
        "department_name":"North Las Vegas Police Department",
        "state_abbreviation":"NV",
        "cause":"Gunfire",
        "date":"2025-02-04",
        "year":2025,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27328-officer-jason-roscow",
        "photo_url":"27328\/125\/c_jason-roscow.jpg",
        "incident_description":"Officer Jason Roscow was shot and killed while responding to a report of a subject brandishing a gun at a resident near the 4700 block of High Creek in North Las Vegas around 2:15 p.m.\n\nWhen Officer Roscow attempted to make contact with the subject, the man ignored him and fled. After locating the man, the subject refused commands and fired at Officer Roscow. Officer Roscow returned fire, killing the subject. \n\nOfficer Roscow was transported to University Medical Center where he succumbed to multiple gunshot wounds. \n\nOfficer Roscow was a United States Air Force veteran and had served with the North Las Vegas Police Department for 17 years. He is survived by two sons.",
        "age":"46",
        "tour":"17 years",
        "badge":"P2090",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"36.2469237",
        "lon":"-115.1599232"
    },
    {
        "name":"Police Officer Jeremy R. Labonte",
        "officer_name":"Jeremy R. Labonte",
        "title":"Police",
        "department_name":"Roswell Police Department",
        "state_abbreviation":"GA",
        "cause":"Gunfire",
        "date":"2025-02-07",
        "year":2025,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27330-police-officer-jeremy-r-labonte",
        "photo_url":"27330\/125\/labonte-jeremy.jpg",
        "incident_description":"Police Officer Jeremy Labonte was shot and killed while responding to a suspicious person reported at a shopping center at 1425 Market Blvd in Roswell around 7:15 p.m.\n\nWhen Officer Labonte arrived at the shopping center, he encountered the subject near the ACE Pickleball Club. While the officer approached the subject for questioning, the man produced a handgun and fired at Officer Labonte multiple times. Officers responding to 911 calls arrived quickly and took the subject into custody. \n\nOfficer Labonte was taken to a local hospital where he succumbed to his wounds.\n\nThe suspect faces charges of murder, aggravated assault against a law enforcement officer, and a weapons charge.\n\nOfficer Labonte had served with the Roswell Police Department for over three years. He is survived by his wife, parents, two sisters, nephew, and grandparents.",
        "age":"24",
        "tour":"3 years, 3 months",
        "badge":"853",
        "weapon":"Not available",
        "offender":"In custody",
        "lat":"34.0169837",
        "lon":"-84.3222610"
    },
    {
        "name":"Trooper Kyle McAcy",
        "officer_name":"Kyle McAcy",
        "title":"Trooper",
        "department_name":"Nebraska State Patrol",
        "state_abbreviation":"NE",
        "cause":"Struck by vehicle",
        "date":"2025-02-17",
        "year":2025,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27332-trooper-kyle-mcacy",
        "photo_url":"27332\/125\/c_mcacy_kyle.jpg",
        "incident_description":"Trooper Kyle McAcy was struck and killed by a snowplow while at the scene of a traffic crash on eastbound Interstate 80 between Ashland and Greenwood. \n\nAround 10:00 a.m., Trooper McAcy was standing outside his patrol car when an approaching snowplow hit him during a snowstorm. Other troopers provided aid, but he succumbed to his injuries at the scene. \n\nTrooper McAcy had served with the Nebraska State Patrol for ten years. He is survived by his fiancee.",
        "age":"31",
        "tour":"10 years",
        "badge":"302",
        "weapon":null,
        "offender":null,
        "lat":"40.9965588",
        "lon":"-96.3409272"
    },
    {
        "name":"Patrolman Andrew William Duarte",
        "officer_name":"Andrew William Duarte",
        "title":"Patrolman",
        "department_name":"West York Borough Police Department",
        "state_abbreviation":"PA",
        "cause":"Gunfire (Inadvertent)",
        "date":"2025-02-22",
        "year":2025,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27336-patrolman-andrew-william-duarte",
        "photo_url":"27336\/125\/c_duarte-andrew.jpg",
        "incident_description":"Patrolman Andrew Duarte was shot and killed while responding to reports of an active shooter at the UPMC Memorial Hospital on Innovation Drive and Roosevelt Avenue in York at 10:43 a.m.\n\nA subject entered the UPMC Memorial Hospital ICU on Saturday morning and, after learning the woman he lived with had died, he pulled out a gun and started firing, striking a doctor and another hospital worker. He continued to threaten hospital employees and took a few hostages. When officers arrived at the scene, the subject shot at officers and ordered them to retreat. Despite efforts to talk to the shooter, he refused to engage. When he emerged from the ICU, he was holding a female nurse hostage, whose hands were bound with zip ties, at gunpoint. Unknown to officers on the scene, the subject was out of ammunition and his gun was empty. When the subject refused to release his hostage, officers fired. Two bullets struck Patrolman Duarte, mortally wounding him.\n\nDuring the standoff, the subject called his brother and shared his situation, stating that he was ready to die.   \n\nFour hospital employees were injured; two were shot and two received other injuries. Two law enforcement officers were shot, and a third was wounded by shrapnel. \n\nIn 2021, Patrolman Duarte received a hero award from Mothers Against Drunk Driving for his work in enforcing impaired driving in Colorado.\n\nPatrolman Duarte had served with the West York Borough Police Department for over two years and previously served with the Denver Police Department for five years. He is survived by his mother and father.",
        "age":"30",
        "tour":"7 years, 10 months",
        "badge":"18",
        "weapon":"Officer's weapon",
        "offender":"Shot and killed",
        "lat":"39.9823149",
        "lon":"-76.7685715"
    },
    {
        "name":"Police Officer Cameron Robert Girvin",
        "officer_name":"Cameron Robert Girvin",
        "title":"Police",
        "department_name":"Virginia Beach Police Department",
        "state_abbreviation":"VA",
        "cause":"Gunfire",
        "date":"2025-02-22",
        "year":2025,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27334-police-officer-cameron-robert-girvin",
        "photo_url":"27334\/125\/c_girvin-cameron24.jpg",
        "incident_description":"Police Officer Cameron Girvin and Police Officer Chris Reese were shot while conducting a traffic stop at Sylvan Court at approximately 11:30 p.m. Friday evening.\n\nWhile on patrol, Officer Girvin and Officer Reese observed a car with an expired plate and executed a traffic stop. During the traffic stop, the officers asked the subject to exit the vehicle, and the subject refused; when finally exiting the vehicle, the subject tussled with the officers and immediately produced a pistol, shooting both Officer Girvin and Officer Reese. While the officers were incapacitated and on the ground, the subject shot each officer a second time and then fled the scene. \n\nThe subject was found in a shed near the initial scene with a self-inflicted gunshot wound to the head.\n\nFirst responders attempted life-saving procedures, and both officers were transported to local hospitals. Officer Girvin succumbed to his wounds at 4:30 a.m. Saturday morning at Virginia Beach General Hospital. Officer Reese had succumbed to his wounds just after midnight at Princess Anne Hospital.\n\nOfficer Girvin had served with the Virginia Beach Police Department for five years. He is survived by his expectant wife and parents.",
        "age":"25",
        "tour":"5 years",
        "badge":"Not available",
        "weapon":"Handgun; Pistol",
        "offender":"Committed suicide",
        "lat":"36.7947242",
        "lon":"-76.1023025"
    },
    {
        "name":"Police Officer Christopher M. L. Reese",
        "officer_name":"Christopher M. L. Reese",
        "title":"Police",
        "department_name":"Virginia Beach Police Department",
        "state_abbreviation":"VA",
        "cause":"Gunfire",
        "date":"2025-02-22",
        "year":2025,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27335-police-officer-christopher-m-l-reese",
        "photo_url":"27335\/125\/c_reese-christopher.jpg",
        "incident_description":"Police Officer Chris Reese and Police Officer Cameron Girvin were shot while conducting a traffic stop at Sylvan Court at approximately 11:30 p.m. Friday evening.\n\nWhile on patrol Officer Reese and Officer Girvin observed a car with an expired plate and executed a traffic stop. During the traffic stop, the officers asked the subject to exit the vehicle, and the subject refused; when finally exiting the vehicle, the subject tussled with the officers and immediately produced a pistol, shooting both Officer Reese and Officer Girvin. While the officers were incapacitated and on the ground, the subject shot each officer a second time and then fled the scene. \n\nThe subject was found in a shed near the initial scene with a self-inflicted gunshot wound to the head.\n\nFirst responders attempted life-saving procedures, and both officers were transported to local hospitals. Officer Reese succumbed to his wounds just after midnight at Princess Anne Hospital. Officer Girvin succumbed to his wounds at 4:30 a.m. Saturday morning at Virginia Beach General Hospital. \n\nOfficer Reese had served with the Virginia Beach Police Department for three years and had previously served for three years with the Virginia Beach Sheriff's Office.",
        "age":"30",
        "tour":"6 years",
        "badge":"Not available",
        "weapon":"Handgun; Pistol",
        "offender":"Committed suicide",
        "lat":"36.7947586",
        "lon":"-76.1023884"
    },
    {
        "name":"Deputy Sergeant Martin Shields, Jr.",
        "officer_name":"Martin Shields, Jr.",
        "title":"Deputy",
        "department_name":"Hinds County Sheriff's Office",
        "state_abbreviation":"MS",
        "cause":"Gunfire",
        "date":"2025-02-23",
        "year":2025,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27337-deputy-sergeant-martin-shields-jr",
        "photo_url":"27337\/125\/c_martin-shields.jpg",
        "incident_description":"Deputy Sheriff Martin Shields was shot and killed while responding to a domestic call at the 15000 block of Midway Road in Terry. \n\nA female requested help in retrieving her belongings from a home. When Deputy Shields and another deputy arrived at the scene, a man inside the house fired at them. The suspect also shot his wife and another female trying to flee the home. \n\nThe women were transported to a local hospital and are in stable condition.\n\nWhen responding officers entered the home, the suspect was found with self-inflicted gunshot wounds. He had a lengthy criminal history; 7 felony arrests and 18 misdemeanor arrests with zero convictions. \n\nDeputy Shields had served with the Hinds County Sheriff's Office for nine months and previously served with the Mississippi Department of Corrections and the Jackson Police Department. He is survived by his wife and daughter. His father had also served with the Hinds County Sheriff's Office.",
        "age":"37",
        "tour":"9 months",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Committed suicide",
        "lat":"32.0792999",
        "lon":"-90.3609021"
    },
    {
        "name":"Police Officer Felicia Dee Reilly",
        "officer_name":"Felicia Dee Reilly",
        "title":"Police",
        "department_name":"Saint Paul Police Department",
        "state_abbreviation":"MN",
        "cause":"Assault",
        "date":"2025-03-01",
        "year":2025,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27350-police-officer-felicia-dee-reilly",
        "photo_url":"27350\/125\/c_officer-reilly.jpg",
        "incident_description":"Police Officer Felicia Reilly succumbed to injuries she received after responding to a 911 hangup call at a residence in the 1600 block of Birmingham Street in Saint Paul on March 24, 2010. \n\nWhen Officer Reilly arrived at the home, she was invited inside and was notified that the elderly couple's son was threatening them. As Officer Reily approached the subject, he began to attack her. She used her taser to subdue him, but he kept swinging and punching her in the face. Despite being tased, the man punched her again, and she fell to the floor where the man proceeded to kick her in the head multiple times. Officer Reilly stood up and attempted to subdue the subject, chasing him outside the home.   \n\nAfter responding officers helped Officer Reilly restrain the subject, she was transported to the hospital for her injuries where she was diagnosed with traumatic brain injury. Throughout the years she suffered from permanent double vision, chronic migraine headaches, light sensitivity, nausea, and a decrease in cognitive functioning, forcing her to retire from the department. She passed away on March 1, 2025, from her injuries.\n\nThe subject was found guilty of assault and sentenced to 8 1\/2 years in prison in 2015. He is unable to be charged with her murder due to the Double Jeopardy Clause in the Fifth Amendment of the United States Constitution. \n\nOfficer Reilly had served with the Saint Paul Police Department for 17 years. She is survived by her husband, three sons, two daughters, two sisters, and grandchildren.",
        "age":"67",
        "tour":"17 years",
        "badge":"720",
        "weapon":"Person",
        "offender":"Sentenced to 8 1\/2 years",
        "lat":"44.9902685",
        "lon":"-93.0405643"
    },
    {
        "name":"Sergeant Joseph Anthony Azcona",
        "officer_name":"Joseph Anthony Azcona",
        "title":"Sergeant",
        "department_name":"Newark Police Division",
        "state_abbreviation":"NJ",
        "cause":"Gunfire",
        "date":"2025-03-08",
        "year":2025,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27352-sergeant-joseph-anthony-azcona",
        "photo_url":"27352\/125\/c_detective-azcona.jpg",
        "incident_description":"Sergeant Joseph Azcona was shot and killed while investigating illegal weapons possession at the corner of Carteret Street and Broadway in Newark. \n\nAt 6:37 p.m. Sergeant Azcona and another officer arrived at the intersection of Carteret Street and Broadway to question a subject about possible weapons possession. The subject began firing on the officers immediately and both officers were struck while still in their vehicle. At least 18 shots were reported near the White Castle at the intersection. When responding officers arrived, they discovered Detective Azcona and the other officer, both wounded. \n\nBoth officers were transported to University Hospital where Sergeant Azcona succumbed to his wounds at 2:30 a.m. The other officer was treated for non-life-threatening injuries.\n\nFive juveniles were taken into custody. A 14-year-old, who was injured, was charged with weapons possession and murder.\n\nSergeant Azcona had served with the Newark Police Division for five years, the last two as a detective. He is survived by his mother, father, and five siblings.\n\nSergeant Azcona was posthumously promoted to Sergeant.",
        "age":"26",
        "tour":"5 years",
        "badge":"Not available",
        "weapon":"Not available",
        "offender":"Taken into custody",
        "lat":"40.7729853",
        "lon":"-74.1612115"
    },
    {
        "name":"Deputy Sheriff Hector Cuevas, Jr.",
        "officer_name":"Hector Cuevas, Jr.",
        "title":"Deputy",
        "department_name":"San Bernardino County Sheriff's Department",
        "state_abbreviation":"CA",
        "cause":"Automobile crash",
        "date":"2025-03-17",
        "year":2025,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27354-deputy-sheriff-hector-cuevas-jr",
        "photo_url":"27354\/125\/cuevas-hector-2025.jpg",
        "incident_description":"Deputy Sheriff Hector Cuevas was killed when his patrol car struck a pole at the intersection of El Evado and Seneca roads just before 11 a.m.\n\nDeputy Cuevas was in pursuit of a stolen vehicle that had been reported to the department just minutes earlier. During the high-speed chase, Deputy Sheriff Cuevas' vehicle collided with another car and then a nearby power pole. The impact of the crash split the patrol vehicle in half, critically injuring Deputy Sheriff Cuevas. Although first responders rushed to administer aid, he passed away at the scene. The driver of the other vehicle was taken to a nearby hospital with non-life-threatening injuries.\n\nThe driver of the stolen vehicle was apprehended a short time later and is in custody, charged with vehicular manslaughter while intoxicated, evading a police officer, and causing death or serious injury. He had a history of evading law enforcement and a lengthy criminal record for vehicular thefts. \n\nDeputy Sheriff Cuevas had served with the San Bernardino County Sheriff's Department for six years. He is survived by his wife, two children, his parents, and his brother and sister.",
        "age":"36",
        "tour":"6 years",
        "badge":"3180",
        "weapon":"Automobile",
        "offender":"In Custody",
        "lat":"34.5141579",
        "lon":"-117.3466627"
    },
    {
        "name":"Sergeant Grant J. Candies",
        "officer_name":"Grant J. Candies",
        "title":"Sergeant",
        "department_name":"St. Tammany Parish Sheriff's Office",
        "state_abbreviation":"LA",
        "cause":"Vehicular assault",
        "date":"2025-03-23",
        "year":2025,
        "weekday":"Sunday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27363-sergeant-grant-j-candies",
        "photo_url":"27363\/125\/c_candies-grant.jpg",
        "incident_description":"Sergeant Grant Candies was killed by the driver fleeing a traffic stop on Interstate 10 in Slidell near the Oak Harbor exit.\n\nThe driver was driving recklessly without a tag on the car when a deputy attempted to stop the vehicle on Brownswitch Road. When the driver refused to stop and continued to drive at speeds of 85-90 mph while swerving on the roads, a pursuit ensued. Just after midnight, Sergeant Candies was deploying a spike strip to assist with stopping the vehicle pursuit when he was struck and killed by the suspects.\n\nThe suspects, all juveniles, continued to evade St. Tammany Parish deputies on Interstate 10 into Orleans Parish, where their vehicle crashed into a New Orleans Police Department unit near Crowder Boulevard at approximately 12:30 a.m.  All suspects were apprehended, and the driver was charged with first-degree murder, attempted first-degree murder, and aggravated flight. Two other juveniles have been charged with first-degree murder and attempted first-degree murder. \n\nThe New Orleans Police Department officer in the unit struck by the suspects was injured but was treated for non-life-threatening injuries and released from the hospital.\n\nSergeant Candies was a United States Marine Corps veteran and had served with the St. Tammany Parish Sheriff's Office for nine years. In 2023, he saved two lives and was named St. Tammany Parish Sheriff's Office Deputy of the Year. He is survived by his wife, two children, mother, father, three sisters, and a brother.",
        "age":"37",
        "tour":"9 years",
        "badge":"115",
        "weapon":"Automobile",
        "offender":"In custody",
        "lat":"30.2266993",
        "lon":"-89.7779875"
    },
    {
        "name":"Police Officer Osmar Rodarte",
        "officer_name":"Osmar Rodarte",
        "title":"Police",
        "department_name":"Marysville Police Department",
        "state_abbreviation":"CA",
        "cause":"Gunfire",
        "date":"2025-03-26",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27367-police-officer-osmar-rodarte",
        "photo_url":"27367\/125\/c_rodarte.jpg",
        "incident_description":"Police Officer Osmar Rodarte was shot and killed while serving a search warrant at Kestrel Court in Olivehurst at 7:50 a.m. \n\nLaw enforcement officers were serving 20 drug trafficking search warrants through the Yuba, Sutter, Tehama, and Butte Counties to stop a transnational drug trafficking ring from Mexico through the United States. When the Sutter regional SWAT team entered the home on Kestral Court, the suspect opened fire, and gunfire was exchanged. Officer Rodarte was struck in the ensuing gunfire. \n\nOfficer Rodarte was transported to Adventist Health and Rideout Hospital, where he succumbed to his wounds. \n\nThe suspect, a convicted felon, was shot and killed at the scene.\n\nOfficer Rodarte was a United States Army veteran and had served with the Marysville Police Department for two years. He is survived by his wife and child.",
        "age":"27",
        "tour":"2 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"39.0648046",
        "lon":"-121.5532825"
    },
    {
        "name":"Deputy Sheriff William May",
        "officer_name":"William May",
        "title":"Deputy",
        "department_name":"Walton County Sheriff's Office",
        "state_abbreviation":"FL",
        "cause":"Gunfire",
        "date":"2025-04-02",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27369-deputy-sheriff-william-may",
        "photo_url":"27369\/125\/c_william-may.jpg",
        "incident_description":"Deputy Sheriff Will May was shot and killed while responding to a disturbance at the Dollar General Market at 10738 US-90 in Defuniak Springs. \n\nAround 2:00 p.m., Deputy May arrived at the store and, after talking to the subject, he decided to escort the man out of the store and not arrest him. As soon as they exited the building, the man pulled out a gun and shot Deputy May a few times. Deputy May returned fire and was able to call for back-up. \n\nDeputy May was transported to North Okaloosa Medical Center with multiple gunshot wounds. One of the bullets went underneath his bulletproof vest, and he passed away over four hours later. \n\nThe suspect died at the scene. \n\nDeputy May was working an overtime shift and was on his way home when he took the disturbance call. He had served with the Walton County Sheriff's Office for over 11 years, the last six of which were as a law enforcement officer. He is survived by his wife, four children, and parents. His mother and father retired from the Walton County Sheriff's Office.",
        "age":"38",
        "tour":"6 years",
        "badge":"Not available",
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"30.7499818",
        "lon":"-86.2915247"
    },
    {
        "name":"Deputy Sheriff Melissa Pollard",
        "officer_name":"Melissa Pollard",
        "title":"Deputy",
        "department_name":"Wood County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Automobile crash",
        "date":"2025-04-09",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27379-deputy-sheriff-melissa-pollard",
        "photo_url":"27379\/125\/c_pollardC-m.jpg",
        "incident_description":"Deputy Sheriff Melissa Pollard was killed when her cruiser collided with the back of a semi-truck at the intersection of FM 14 and State Highway 37-S, between Quitman and Winnsboro, at approximately 10 a.m.\n\nDeputy Sheriff Pollard succumbed to her injuries at UT Health Quitman.\n\nThe driver of the semi-truck was not injured.\n\nDeputy Pollard had served with the Wood County Sheriff's Office for over eight years and had previously served with the Fannin County Sheriff's Office for three years and the Collin County Sheriff's Office for ten years. She is survived by her daughter, two sisters, her partner, and three grandchildren.",
        "age":"47",
        "tour":"21 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"32.8744743",
        "lon":"-95.3450108"
    },
    {
        "name":"Captain Helio Armando Garcia, III",
        "officer_name":"Helio Armando Garcia,",
        "title":"Captain",
        "department_name":"South Fulton Police Department",
        "state_abbreviation":"GA",
        "cause":"Automobile crash",
        "date":"2025-04-16",
        "year":2025,
        "weekday":"Wednesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27380-captain-helio-armando-garcia-iii",
        "photo_url":"27380\/125\/c_helio-garciaC-iii.jpg",
        "incident_description":"Captain Helio Garcia was killed when his patrol car was struck by another vehicle at approximately 11:30 p.m. on Flat Shoals Road close to Connell Road.\n\nCaptain Garcia was on patrol when a vehicle veered into his lane and hit his patrol car head-on. Captain Garcia was taken to Grady Memorial Hospital where he succumbed to his injuries early the next morning. \n\nThe driver of the other vehicle remains in serious condition.\n\nCaptain Garcia was a United States Marine Corps veteran who had served with the South Fulton Police Department for over six years. He had previously served with the College Park Police Department and the Holy Springs Police Department and was instrumental in forming the South Fulton Police Department. He is survived by his wife, two daughters, a son, his mother, his father, and two brothers.\n\nCaptain Garcia was posthumously promoted to Captain.",
        "age":"47",
        "tour":"15 years",
        "badge":"108",
        "weapon":"Automobile",
        "offender":"In hospital",
        "lat":"33.5803662",
        "lon":"-84.5026229"
    },
    {
        "name":"Deputy Sheriff Jesse Perez",
        "officer_name":"Jesse Perez",
        "title":"Deputy",
        "department_name":"Dawson County Sheriff's Office",
        "state_abbreviation":"TX",
        "cause":"Blunt force trauma",
        "date":"2025-04-22",
        "year":2025,
        "weekday":"Tuesday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27382-deputy-sheriff-jesse-perez",
        "photo_url":"27382\/125\/c_jesse-perez.jpg",
        "incident_description":"Deputy Sheriff Jesse Perez was killed when debris from a commercial vehicle struck him during a traffic stop on West U.S. Highway 180 in Lamesa. \n\nHe succumbed to his injuries at Lamesa Medical Arts Hospital. \n\nDeputy Perez had served with the Dawson County Sheriff's Office for eight months. He is survived by his wife, three daughters, a son, mother, two brothers, a sister, and a grandson.",
        "age":"42",
        "tour":"8 months",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"32.7338309",
        "lon":"-101.9791310"
    },
    {
        "name":"Deputy Sheriff Brandon Ray Sikes",
        "officer_name":"Brandon Ray Sikes",
        "title":"Deputy",
        "department_name":"Columbia County Sheriff's Office",
        "state_abbreviation":"GA",
        "cause":"Gunfire",
        "date":"2025-04-26",
        "year":2025,
        "weekday":"Saturday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27384-deputy-sheriff-brandon-ray-sikes",
        "photo_url":"27384\/125\/c_brandon-sikes.jpg",
        "incident_description":"Deputy Sheriff Brandon Sikes was shot and killed during an attempted traffic stop just before exit 194 on Interstate 20, near Augusta, at approximately 6:30 p.m.\n\nDeputy Sikes and three other deputies were serving a domestic violence protective order on the subject. At first, the man was compliant and non-threatening, but when deputies turned away, he fired at them with a 9mm AR Pistol. Deputy Sikes was mortally wounded. Another deputy was shot in the face. Two deputies returned fire. One of the deputies gathered the injured deputy through a barrage of gunfire and transported him to the hospital, where he is in critical condition. \n\nThe suspect attempted to flee in his camper but was stopped on the highway. Hours later, drones found the suspect dead inside his camper with pipe bombs, firearms, and ammunition.  \n\nDeputy Sikes was a United States Army veteran and had served with the Columbia County Sheriff's Office for over six years. He is survived by his wife, who also serves with the agency, a daughter, parents, three brothers, nieces, and a nephew.",
        "age":"31",
        "tour":"6 years, 5 months",
        "badge":"608",
        "weapon":"Handgun; 9 mm",
        "offender":"Deceased",
        "lat":"33.4834721",
        "lon":"-82.1263052"
    },
    {
        "name":"Special Deputy Sheriff Larry Henderson, Jr.",
        "officer_name":"Special   Larry Henderson, Jr.",
        "title":"Deputy",
        "department_name":"Hamilton County Sheriff's Office",
        "state_abbreviation":"OH",
        "cause":"Vehicular assault",
        "date":"2025-05-02",
        "year":2025,
        "weekday":"Friday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27386-special-deputy-sheriff-larry-henderson-jr",
        "photo_url":"27386\/125\/c_larry-henderson.jpg",
        "incident_description":"Special Deputy Sheriff Larry Henderson was intentionally struck and killed by a driver while directing traffic at the intersection of Martin Luther King Drive and Burnett Woods Drive in Cincinnati.  \n\nAt 1:00 p.m., Deputy Henderson was providing traffic control and monitoring the traffic signal box near the University of Cincinnati for their commencement ceremonies. While standing on the sidewalk, a driver deliberately drove his vehicle into Deputy Henderson. \n\nDeputy Henderson was transported to the UC Medical Center, where he succumbed to his injuries. \n\nThe driver, who had recently viewed body camera footage of his son being shot and killed after fleeing a stolen vehicle armed with a handgun, was arrested and charged with aggravated murder. \n\nDeputy Henderson was a United States Marine Corps veteran and had served with the Hamilton County Sheriff's Office for 33 years. He is survived by his wife and five children. Two of Deputy Henderson's uncles and four cousins also served in law enforcement.",
        "age":"57",
        "tour":"33 years",
        "badge":"129",
        "weapon":"Automobile",
        "offender":"Charged with murder",
        "lat":"39.1353279",
        "lon":"-84.5012141"
    },
    {
        "name":"Lieutenant Allen \"Noochie\" Credeur",
        "officer_name":"Allen \"Noochie\" Credeur",
        "title":"Lieutenant",
        "department_name":"Rayne Police Department",
        "state_abbreviation":"LA",
        "cause":"Gunfire (Inadvertent)",
        "date":"2025-05-05",
        "year":2025,
        "weekday":"Monday",
        "canine":false,
        "url":"https:\/\/www.odmp.org\/officer\/27393-lieutenant-allen-noochie-credeur",
        "photo_url":"27393\/125\/c_allen-credeur.jpg",
        "incident_description":"Lieutenant Noochie Credeur was shot and killed by friendly fire while serving a search warrant at the 500 block of East Harrop Street in Rayne. \n\nAt 1:27, Lieutenant Credeur was attempting to locate a suspect wanted for attempted murder in a stabbing incident when he was hit by friendly fire. Despite life-saving measures, Lieutenant Credeur succumbed to his wounds at the scene.  \n\nLieutenant Credeur had served with the Rayne Police Department for over 20 years. He is survived by his brother and fiancée.",
        "age":"49",
        "tour":"20 years",
        "badge":"Not available",
        "weapon":null,
        "offender":null,
        "lat":"30.2379109",
        "lon":"-92.2650281"
    },
    {
        "name":"K9 Kaya",
        "officer_name":"Kaya",
        "title":"K9",
        "department_name":"Streetsboro Police Department",
        "state_abbreviation":"OH",
        "cause":"Struck by vehicle",
        "date":"2025-01-07",
        "year":2025,
        "weekday":"Tuesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1936-k9-kaya",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1936\/125\/c_k9-kaya.jpg",
        "incident_description":"K9 Kaya was struck and killed by a passing motorist on SR 303.\n\nAt 5:35 p.m., K9 Kaya exited the patrol vehicle to stretch his legs in an area west of the Streetsboro Police Department. While chasing a ball 600 feet away from the roadway, K9 Kaya unexpectedly redirected and crossed onto SR 303, where a vehicle passing by hit him. He was transported to Metropolitan Veterinary Hospital where he succumbed to his injuries an hour later. \n\nThe driver stayed at the scene and cooperated with the authorities. \n\nK9 Kaya had served with the Streetsboro Police Department for almost nine years. He died three days before his ninth birthday.",
        "age":"8",
        "tour":"8 years, 11 months",
        "badge":null,
        "weapon":"Automobile",
        "offender":null,
        "lat":"41.2386728",
        "lon":"-81.3187015"
    },
    {
        "name":"K9 Macho",
        "officer_name":"Macho",
        "title":"K9",
        "department_name":"Jefferson Parish Sheriff's Office",
        "state_abbreviation":"LA",
        "cause":"Heart attack",
        "date":"2025-01-15",
        "year":2025,
        "weekday":"Wednesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1939-k9-macho",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1939\/125\/c_macho.jpg",
        "incident_description":"K9 Macho suffered a fatal heart attack after apprehending a suspect who was wanted on outstanding warrants at the 2000 block of Estalote Avenue in Harvey. \n\nK9 Macho and the Jefferson Parish Sheriff's Office's SWAT Team were assisting the United States Marshals Service in serving an arrest warrant on a wanted fugitive. When the suspect refused to exit the home, drones and robots were sent into the house during the standoff. As soon as the suspect was located hiding inside a box spring in one of the bedrooms, K9 Macho was sent in to apprehend the suspect. \n\nAround 10:50 a.m., K9 Macho seized the suspect by biting him to keep him in place until other SWAT Team members could apprehend the man. During the apprehension, K9 Macho's handler noticed something was off and removed him from the suspect. K9 Macho collapsed, and CPR was performed. Despite resuscitation attempts, K9 Macho was unable to be revived.\n\nThe suspect was taken into custody. \n\nK9 Macho had served with the Jefferson Parish Sheriff's Office for six years. He had more than 200 deployments and made more than 100 apprehensions.",
        "age":"8",
        "tour":"6 years",
        "badge":null,
        "weapon":null,
        "offender":"In custody",
        "lat":"29.8818513",
        "lon":"-90.0680311"
    },
    {
        "name":"K9 Roxi",
        "officer_name":"Roxi",
        "title":"K9",
        "department_name":"Miami-Dade Sheriff's Office",
        "state_abbreviation":"FL",
        "cause":"Vehicular assault",
        "date":"2025-02-01",
        "year":2025,
        "weekday":"Saturday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1937-k9-roxi",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1937\/125\/c_roxi.jpg",
        "incident_description":"K9 Roxi succumbed to injuries she received in a vehicle crash during a pursuit of a wanted felon. \n\nWhen deputies attempted to initiate a traffic stop, the suspect continued driving, and a pursuit ensued. At Northwest 72nd Street and Northwest 1st Avenue, the suspect intentionally struck the K9 SUV, crashing the vehicle into a concrete wall. \n\nK9 Roxi was transported to an emergency veterinarian hospital where she died two days later. \n\nThe suspect was arrested and charged with trafficking fentanyl, possession of a firearm by a convicted felon, aggravated battery on a law enforcement officer, fleeing and eluding, causing injury, possession of a controlled substance with the intent to sell, possession of THC and resisting an officer with violence.\n\nK9 Roxi had served with the Miami-Dade Sheriff's Office for over seven months.",
        "age":"Not available",
        "tour":"7 years, 9 months",
        "badge":null,
        "weapon":"Automobile",
        "offender":null,
        "lat":"25.8411941",
        "lon":"-80.1988310"
    },
    {
        "name":"K9 Preacher",
        "officer_name":"Preacher",
        "title":"K9",
        "department_name":"Maine State Police",
        "state_abbreviation":"ME",
        "cause":"Gunfire",
        "date":"2025-02-04",
        "year":2025,
        "weekday":"Tuesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1938-k9-preacher",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1938\/125\/c_preacher-and-handler.jpg",
        "incident_description":"K9 Preacher succumbed to gunshot wounds he received while pursuing a fleeing domestic suspect on Ranger Street in Portage Lake, Maine. \n\nLaw enforcement responded to a report of a domestic situation and convinced the subject to talk to them outside of the home. As officers attempted to arrest the suspect, he pulled out a gun and fired at officers, striking an Aroostook County Sheriff's deputy in the shoulder. The suspect was able to barricade himself in the home despite hours of negotiations. When the suspect attempted to escape, his vehicle was disabled, so he fled on foot with K9 Preacher in pursuit. The suspect fired at K9 Preacher, hitting him in the abdomen. \n\nA Maine State Police trooper returned fire, killing the suspect. \n\nThe deputy was taken to a local hospital for treatment and was released. \n\nK9 Preacher was transported to an emergency veterinary hospital and survived surgery, but he passed away the following morning. \n\nK9 Preacher had served with the Maine State Police for over one year.",
        "age":"4",
        "tour":"1 year, 6 months",
        "badge":null,
        "weapon":"Gun; Unknown type",
        "offender":"Shot and killed",
        "lat":"46.7601824",
        "lon":"-68.4779863"
    },
    {
        "name":"K9 Azi",
        "officer_name":"Azi",
        "title":"K9",
        "department_name":"McKinney Police Department",
        "state_abbreviation":"TX",
        "cause":"Gunfire",
        "date":"2025-03-13",
        "year":2025,
        "weekday":"Thursday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1940-k9-azi",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1940\/125\/c49_azi_mckinneypd.jpg",
        "incident_description":"K9 Azi was shot and killed while attempting to apprehend a subject who barricaded himself in a hotel room at the Red Roof Inn at 1300 North Central Expressway in McKinney. \n\nAround 2:44 p.m., McKinney officers responded to a shooting call and discovered a female had been shot. The suspect barricaded himself in a hotel room and threatened to shoot everyone. When the suspect exited the room about 30 minutes later, K9 Azi was deployed to apprehend him. The suspect pulled out his gun and shot K9 Azi, fatally wounding him. Responding officers returned fire, hitting the suspect. The suspect succumbed to his wounds at the hospital. \n\nThe female victim was transported to a local hospital and is in stable condition. \n\nK9 Azi was taken to an Urgent Care Vet Clinic, but had passed away.\n\nK9 Azi had served with the McKinney Police Department for one year and four months.",
        "age":"2",
        "tour":"1 year, 4 months",
        "badge":null,
        "weapon":"Handgun",
        "offender":"Shot and killed",
        "lat":"33.2090882",
        "lon":"-96.6372275"
    },
    {
        "name":"K9 Blitz",
        "officer_name":"Blitz",
        "title":"K9",
        "department_name":"Wadesboro Police Department",
        "state_abbreviation":"NC",
        "cause":"Gunfire",
        "date":"2025-04-02",
        "year":2025,
        "weekday":"Wednesday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1942-k9-blitz",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1942\/125\/c_blitz.jpg",
        "incident_description":"K9 Blitz was shot while apprehending a suspect who fled from officers during a traffic stop. \n\nOfficers attempted to stop a vehicle on U.S. Highway 74 for fictitious plates. The driver fled, leading to a pursuit that lasted over twenty miles. When the suspect's vehicle's tires were blown in Mt. Gilead, the suspect attempted to flee on foot. K9 Blitz was deployed to apprehend the man. After the suspect was captured, K9 Blitz became more aggressive and was tased and pepper-sprayed. When K9 Blitz attacked a third officer and would not let go, he was shot.  \n\nThe suspect, who had warrants out for his arrest, was charged with assaulting a law enforcement agency animal, eluding arrest, assault with a deadly weapon, multiple drug possession charges, and traffic violations.\n\nK9 Blitz had served with the Wadesboro Police Department for two months.",
        "age":"Not available",
        "tour":"2 months",
        "badge":null,
        "weapon":"Officer's handgun",
        "offender":"In custody",
        "lat":"34.9644521",
        "lon":"-80.0785981"
    },
    {
        "name":"K9 Chico",
        "officer_name":"Chico",
        "title":"K9",
        "department_name":"Boerne Police Department",
        "state_abbreviation":"TX",
        "cause":"Struck by vehicle",
        "date":"2025-04-10",
        "year":2025,
        "weekday":"Thursday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1943-k9-chico",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1943\/125\/c_chico_.JPG",
        "incident_description":"K9 Chico was struck and killed by a hit-and-run driver on Interstate 10 East at 12:50 a.m.\n\nK9 Chico and his handler had completed a traffic stop with a K9 deployment on the Interstate 10 Frontage Road. After K9 Chico was secured in his patrol cage, his handler started to pull out of the parking lot, unaware that the door mechanism and safety feature had malfunctioned. K9 Chico jumped out of the patrol car and ran onto Interstate 10, where he was struck by a vehicle that did not stop. \n\nThe safety feature should have alerted the handler that the door did not close properly. An investigation into the malfunction has been started. \n\nK9 Chico had served with the Boerne Police Department for over a year.",
        "age":"5",
        "tour":"1 year, 5 months",
        "badge":null,
        "weapon":"Automobile",
        "offender":"At large",
        "lat":"29.7988286",
        "lon":"-98.7529658"
    },
    {
        "name":"K9 Knox",
        "officer_name":"Knox",
        "title":"K9",
        "department_name":"Roanoke City Police Department",
        "state_abbreviation":"VA",
        "cause":"Vehicle pursuit",
        "date":"2025-04-18",
        "year":2025,
        "weekday":"Friday",
        "canine":true,
        "url":"https:\/\/www.odmp.org\/k9\/1944-k9-knox",
        "photo_url":"https:\/\/www.odmp.org\/media\/image\/k9\/1944\/125\/c_knox.jpg",
        "incident_description":"K9 Knox was struck and killed during a pursuit of a stolen vehicle around 1:40 a.m.\n\nOfficers attempted to stop the driver of a stolen vehicle at a gas station on Melrose Avenue NW. The suspect fled the scene, and a short pursuit ensued. When the car stopped on the 4200 block of Vermont Avenue NW, the driver ran from the scene. K9 Knox was then deployed to apprehend the suspect. As K9 Knox was in pursuit, another police vehicle struck him. \n\nK9 Knox was transported to Emergency Veterinarian Services, where he passed away from his injuries.\n\nThe suspect, a convicted felon with outstanding warrants, fled the scene and has not been apprehended. The passenger in the stolen vehicle is in custody with outstanding warrants. \n\nK9 Knox had served with the Roanoke City Police Department for almost two years.",
        "age":"3",
        "tour":"1 year, 11 months",
        "badge":null,
        "weapon":"Automobile",
        "offender":null,
        "lat":"37.2984484",
        "lon":"-80.0046327"
    }
]